{
    "category_questions": [
        {
            "id": "-100",
            "category": "Write Our Own Question",
            "plan": "2",
            "priority": "-100",
            "questions": [
                {
                    "id": "",
                    "question": ""
                }
            ]
        },
        {
            "id": "1",
            "category": "Children",
            "plan": "1",
            "priority": "1",
            "questions": [
                {
                    "id": "1",
                    "question": "Why do I want to dialogue in the area of child raising? HDIFAT??"
                },
                {
                    "id": "2",
                    "question": "What do I hope to gain in the area of child raising? HDIFAT?"
                },
                {
                    "id": "3",
                    "question": "What do I like best about you in the area of child raising? HDIFAT?"
                },
                {
                    "id": "4",
                    "question": "What do I like least about you in the area of child raising? HDIFAT?"
                },
                {
                    "id": "5",
                    "question": "What do I like best about myself in the area of child raising? HDIFAT?"
                },
                {
                    "id": "6",
                    "question": "What do I like least about myself in the area of child raising? HDIFAT?"
                },
                {
                    "id": "7",
                    "question": "What do I like best about us in the area of child raising? HDIFAT?"
                },
                {
                    "id": "8",
                    "question": "What mask do I wear in the area of child raising? HDIFAT?"
                },
                {
                    "id": "9",
                    "question": "When am I least open to listen to you in the area of child raising? HDIFAT?"
                },
                {
                    "id": "10",
                    "question": "In the area of child raising what feeling do I find most difficult to share  with you? Describe feelings in loving detail."
                },
                {
                    "id": "11",
                    "question": "How has/would never having children affect my/our life? HDIF about this?"
                },
                {
                    "id": "12",
                    "question": "How have our children experienced our love this week? HDIF sharing this with  you?"
                },
                {
                    "id": "13",
                    "question": "How do I feel about being a sign of God's Love to our children or to other  children? HDTMMF?"
                },
                {
                    "id": "14",
                    "question": "What change have I seen in our children since dialogue? HDIFAT?"
                },
                {
                    "id": "15",
                    "question": "How do our children's activities affect our relationship? HDIFAT?"
                },
                {
                    "id": "16",
                    "question": "HDIF about putting you first when our children are so demanding?"
                },
                {
                    "id": "1357",
                    "question": "Weekend Qs"
                }
            ]
        },
        {
            "id": "2",
            "category": "Communications",
            "plan": "1",
            "priority": "2",
            "questions": [
                {
                    "id": "17",
                    "question": "Do I try to fix your problems, or just listen and accept how you feel about  them? HDIFAMA?"
                },
                {
                    "id": "18",
                    "question": "When I want you to listen to me, do I also want you to agree with me? HDTMMF?"
                },
                {
                    "id": "19",
                    "question": "Am I open in our nonverbal communication? HDIFAT?"
                },
                {
                    "id": "20",
                    "question": "What topic gives me the most difficulty in listening to you? HDIFAT?"
                },
                {
                    "id": "21",
                    "question": "HDIF when I'm talking to you and you don't seem to be listening?"
                },
                {
                    "id": "22",
                    "question": "What areas have I closed my ears to listening to you? HDIFAMA?"
                },
                {
                    "id": "23",
                    "question": "I am most likely to criticize you about... HDIFAMA?"
                },
                {
                    "id": "24",
                    "question": "Recently, I thought it was selfish/thoughtless of me to say to you... HDIF  telling you this?"
                },
                {
                    "id": "25",
                    "question": "Recently, how have I been judgemental of you? HDMAMMF?"
                },
                {
                    "id": "26",
                    "question": "How well do I listen to you when we talk about death? Do I truly listen to you,  or do I just hear you? Are there behaviors that get in the way of me listening  to you in this area? HDIFAMA?"
                },
                {
                    "id": "27",
                    "question": "How well do I listen to you when we talk about sex? Do I truly listen to you,  or do I just hear you? Are there behaviors that get in the way of me listening  to you in this area? HDIFAMA?"
                },
                {
                    "id": "28",
                    "question": "How well do I listen to you when we talk about finances? Do I truly listen to  you, or do I just hear you? Are there behaviors that get in the way of me  listening to you in this area? HDIFAMA?"
                },
                {
                    "id": "29",
                    "question": "How well do I listen to you when we talk about family? Do I truly listen to  you, or do I just hear you? Are there behaviors that get in the way of me  listening to you in this area? HDIFAMA?"
                },
                {
                    "id": "30",
                    "question": "I find it difficult to listen to you when... HDIFAMA?"
                },
                {
                    "id": "31",
                    "question": "Your specialness today was... HDIFAT?"
                },
                {
                    "id": "32",
                    "question": "Have I been critical or accepting of you this week? HDMAMMF? What am I willing  to do for the sake of our relationship to make this better?"
                },
                {
                    "id": "33",
                    "question": "How well do I think I listen to you? What can I do to listen better? HDIFAT and  sharing this with you?"
                },
                {
                    "id": "34",
                    "question": "When was the last time I complimented you? HDIFAMA?"
                },
                {
                    "id": "35",
                    "question": "What area do I least want to talk to you about? HDIF telling you this?"
                },
                {
                    "id": "36",
                    "question": "I enjoy hearing you talk about... HDIF sharing this with you?"
                },
                {
                    "id": "37",
                    "question": "This week, what have I avoided talking to you about and why? HDIFAT?"
                },
                {
                    "id": "38",
                    "question": "Our intimacy is renewed each time we communicate more deeply. HDIFAT?"
                },
                {
                    "id": "39",
                    "question": "What is the most effective way I can communicate forgiveness?"
                },
                {
                    "id": "40",
                    "question": "What could I do to break down barriers between us?\" DYFID."
                },
                {
                    "id": "41",
                    "question": "What steps can we take to talk more about us?"
                },
                {
                    "id": "42",
                    "question": "HDIF when there is silence between us?"
                }
            ]
        },
        {
            "id": "3",
            "category": "Conflict",
            "plan": "1",
            "priority": "3",
            "questions": [
                {
                    "id": "43",
                    "question": "After we have had a fight, what is the most positive thing that comes out of  it? HDIFAMA?"
                },
                {
                    "id": "45",
                    "question": "How do I feel when you do something that disrupts my plans? Describe in loving  detail."
                },
                {
                    "id": "46",
                    "question": "Do I accept myself? Why or why not? HDIFAMA?"
                },
                {
                    "id": "47",
                    "question": "What is most likely to cause a disagreement when we are trying to make a  decision? HDIFAMA?"
                },
                {
                    "id": "48",
                    "question": "In times of trouble, where do I look first for help, you or God? HDIFAMA?"
                },
                {
                    "id": "49",
                    "question": "In times of trouble, where do I look first for solace, you or God? HDIFAMA?"
                },
                {
                    "id": "50",
                    "question": "In times of trouble, where do I look first for comfort, you or God? HDIFAMA?"
                },
                {
                    "id": "51",
                    "question": "Am I more likely to voice my discontent and disapproval, or do I hold my tongue  to avoid causing problems? HDIFAMA?"
                },
                {
                    "id": "52",
                    "question": "What is my mask when we have an argument? HDIFAT?"
                },
                {
                    "id": "53",
                    "question": "HDIF when we disagree in front of others?"
                },
                {
                    "id": "54",
                    "question": "HDIF when I see anger or annoyance on your face?"
                },
                {
                    "id": "55",
                    "question": "Do I ever change what I write or say to avoid conflict or argument? Why?  HDIFAMA?"
                },
                {
                    "id": "56",
                    "question": "What is the best thing for me to do when I get angry? HDMAMMF?"
                },
                {
                    "id": "57",
                    "question": "How do I feel when you take up too much of my time? HDMAMMF?"
                },
                {
                    "id": "58",
                    "question": "What negative attitudes and behaviors do I display during difficult situations  or periods? How do I feel about this?"
                },
                {
                    "id": "59",
                    "question": "What do I need from you when we are trying to get through a difficult situation  or period? How do I feel sharing this with you?"
                },
                {
                    "id": "60",
                    "question": "After a fight, is it easy or hard for my to ask for forgiveness? Why? HDIFAMA?"
                },
                {
                    "id": "61",
                    "question": "What feelings do I have about selecting dialogue questions that appear  difficult? HDIFA sharing this with you?"
                },
                {
                    "id": "62",
                    "question": "What are the topics I avoid in dialogue? What are my feelings about my answer?"
                },
                {
                    "id": "63",
                    "question": "What do I need from you when we are trying to get through a difficult situation  or period? HDIF sharing this with you?"
                },
                {
                    "id": "64",
                    "question": "Do I ever change what I write or say to avoid conflict or argument? Why?  HDIFAMA?"
                },
                {
                    "id": "65",
                    "question": "What do I dislike most about myself when we fight? HDIFAMA?"
                },
                {
                    "id": "66",
                    "question": "How do we usually handle conflict in our relationship? HDIFAMA?"
                },
                {
                    "id": "67",
                    "question": "How do I feel when someone interrupts me while I am talking to you? Describe in  loving detail."
                },
                {
                    "id": "68",
                    "question": "How do I feel just before I tell you something I don't think you will like?  Describe in loving detail."
                },
                {
                    "id": "69",
                    "question": "How do I feel when your needs seem to be in conflict with mine? Describe in  loving detail."
                },
                {
                    "id": "70",
                    "question": "When we have disagreements on Retrouvaille, do I/we play fair, or fight dirty?  HDIFAMA?"
                },
                {
                    "id": "71",
                    "question": "What comments about myself am I most likely to take personally? HDTMMF?"
                },
                {
                    "id": "72",
                    "question": "How do I feel when someone insults one of my ideas? Describe in loving detail."
                },
                {
                    "id": "73",
                    "question": "What is most likely to cause a disagreement when we are trying to make a  decision? HDIFAMA?"
                },
                {
                    "id": "74",
                    "question": "What is the biggest challenge facing us this week? What can I do to help you  through it? HDIFAMA?"
                },
                {
                    "id": "75",
                    "question": "In what area do we have hurt in our relationship? HDIF sharing this with you?"
                },
                {
                    "id": "76",
                    "question": "Do I sometimes provoke fights even if I don't start them? HDIFAMA?"
                },
                {
                    "id": "77",
                    "question": "How do I feel when I would like to say no, but don't think I can? Describe in  loving detail."
                },
                {
                    "id": "78",
                    "question": "How do we usually deal with conflict in our relationship? HDIFAMA?"
                },
                {
                    "id": "79",
                    "question": "How do I usually deal with conflict in my relationships? HDIFAMA?"
                },
                {
                    "id": "80",
                    "question": "How do I feel when I/we are in a hurry to leave, and someone stops by and  wants/needs to talk? Describe in loving detail."
                },
                {
                    "id": "81",
                    "question": "How do I feel when we are torn between our families?"
                },
                {
                    "id": "82",
                    "question": "How can we avoid non productive fights? HDIFTYT?"
                },
                {
                    "id": "83",
                    "question": "Is fighting a constructive means of communication between us?"
                },
                {
                    "id": "84",
                    "question": "After conflict, am I still feeling hurt? DYFID?"
                },
                {
                    "id": "85",
                    "question": "After a fight am I still pretending not to care? HDIFAT?"
                },
                {
                    "id": "86",
                    "question": "HDIF when we argue because we remember things differently?"
                },
                {
                    "id": "87",
                    "question": "HDIF when we negotiate a compromise between us?"
                },
                {
                    "id": "88",
                    "question": "After our last fight, who got hurt? How? HDIFAT?"
                },
                {
                    "id": "89",
                    "question": "We tend to compete against each other in _______ . HDIFAT?"
                },
                {
                    "id": "90",
                    "question": "HDIF when I try holding my temper?"
                },
                {
                    "id": "91",
                    "question": "What words would I take back if I could? HDIFAT?"
                }
            ]
        },
        {
            "id": "4",
            "category": "Death",
            "plan": "1",
            "priority": "4",
            "questions": [
                {
                    "id": "92",
                    "question": "Why do I want to dialogue in the area of death? HDIFAT?"
                },
                {
                    "id": "93",
                    "question": "What do I hope to gain in the area of death? HDIFAT?"
                },
                {
                    "id": "94",
                    "question": "What do I like best about you in the area of death? HDIFAT?"
                },
                {
                    "id": "95",
                    "question": "What do I like least about you in the area of death? HDIFAT?"
                },
                {
                    "id": "96",
                    "question": "What do I like best about myself in the area of death? HDIFAT?"
                },
                {
                    "id": "97",
                    "question": "What do I like least about myself in the area of death? HDIFAT?"
                },
                {
                    "id": "98",
                    "question": "What do I like best about us in the area of death? HDIFAT?"
                },
                {
                    "id": "99",
                    "question": "What mask do I wear in the area of death? HDIFAT?"
                },
                {
                    "id": "100",
                    "question": "When am I least open to listen to you in the area of death? HDIFAT?"
                },
                {
                    "id": "101",
                    "question": "In the area of death what feeling do I find most difficult to share with you?  Describe feelings in loving detail."
                },
                {
                    "id": "102",
                    "question": "How do I feel knowing that today could be my last day? Describe in loving  detail."
                },
                {
                    "id": "103",
                    "question": "If I was about to die, and only had time to tell you one sentence, what would  it be? HDIF telling you this?"
                },
                {
                    "id": "104",
                    "question": "If I found out I was going to die today, how would I feel about the way I've  lived the last few weeks? Describe in loving detail."
                },
                {
                    "id": "105",
                    "question": "What kind of death frightens me the most? HDIFAMA?"
                },
                {
                    "id": "106",
                    "question": "What would I do differently today if I knew I wouldn't have you tomorrow?  HDMAMMF?"
                },
                {
                    "id": "107",
                    "question": "How do I feel when someone close to me dies? Describe in loving detail."
                }
            ]
        },
        {
            "id": "5",
            "category": "Dialogue",
            "plan": "1",
            "priority": "5",
            "questions": [
                {
                    "id": "108",
                    "question": "How do I feel about the phrase, 'Dialogue is my gift of myself to you?'  Describe in loving detail."
                },
                {
                    "id": "109",
                    "question": "How do I usually feel when I don't want to dialogue? Describe in loving  detail."
                },
                {
                    "id": "110",
                    "question": "What is the most difficult part of my/our dialogue? HDIFAMA?"
                },
                {
                    "id": "111",
                    "question": "How do I feel about my (or our) dialogue? Describe in loving detail."
                },
                {
                    "id": "112",
                    "question": "What proof is there in our life that dialogue is important to our relationship?  HDIFAMA?"
                },
                {
                    "id": "113",
                    "question": "Dialogue questions are sometimes silly. HDIFAT?"
                },
                {
                    "id": "114",
                    "question": "What have I learned about myself through dialogue? HDIFAMA?"
                },
                {
                    "id": "115",
                    "question": "Have we been open in our daily dialogue? HDIFAMA?"
                },
                {
                    "id": "116",
                    "question": "What aspect of dialogue is hardest for me, or I am most uncomfortable with?  (writing, listening, describing my feeling, etc.) How do I feel sharing this  with you?"
                },
                {
                    "id": "117",
                    "question": "Have we been open in our daily dialogue? HDIFAMA?"
                },
                {
                    "id": "118",
                    "question": "How do I feel when someone asks me/us, 'How is your dialogue?' Describe in  loving detail."
                },
                {
                    "id": "119",
                    "question": "Do I sometimes write something different than what I feel in order to protect  you or myself? HDIFAMA?"
                },
                {
                    "id": "120",
                    "question": "How do I feel when others think they don't need to dialogue? Describe the  feeling in loving detail."
                },
                {
                    "id": "121",
                    "question": "What effect has dialogue made in our daily lives? HDTMMF?"
                },
                {
                    "id": "122",
                    "question": "In what way has our dialogue made us grow in the last week? HDIFAT?"
                },
                {
                    "id": "123",
                    "question": "Where on my list of priorities did I place our dialogue today? HDIFAT?"
                },
                {
                    "id": "124",
                    "question": "Since dialogue, am I more comfortable talking about sex and death with other  people? HDIFAT?"
                },
                {
                    "id": "125",
                    "question": "What feelings do I have about selecting dialogue questions that appear  difficult? HDIF sharing this with you?"
                },
                {
                    "id": "126",
                    "question": "Listening is most difficult for me when... How do I feel about this?"
                },
                {
                    "id": "127",
                    "question": "Since we added dialogue into our lives, how am I experiencing you differently?  HDTMMF?"
                },
                {
                    "id": "128",
                    "question": "How has your writing a dialogue letter to me, each time you do, affected our  relationship? HDTMMF?"
                },
                {
                    "id": "129",
                    "question": "How have we benefitted by choosing to dialogue at home? HDIF sharing this with  you?"
                },
                {
                    "id": "130",
                    "question": "Do I ever use our dialog letter for something other than sharing my feelings  with you? HDIF sharing this with you?"
                },
                {
                    "id": "131",
                    "question": "How has dialog changed our lives? HDIFAMA?"
                },
                {
                    "id": "132",
                    "question": "How do I feel about the honesty and openness of our dialogue? HDIF sharing this  with you?"
                },
                {
                    "id": "133",
                    "question": "What can we do to improve our dialog? HDIF sharing this with you?"
                },
                {
                    "id": "134",
                    "question": "What sacrifices am I willing to make for our daily Dialogue? HDMAMMF?"
                },
                {
                    "id": "135",
                    "question": "What Dialogue has meant the most to me? HDIF telling you this?"
                },
                {
                    "id": "136",
                    "question": "Is describing my feelings in a letter easy or hard to do? HDIFAMA?"
                },
                {
                    "id": "137",
                    "question": "What has dialog taught me about myself? HDIFT?"
                },
                {
                    "id": "138",
                    "question": "If dialogue is so important to our relationship, why do we miss? HDMAMMF?"
                },
                {
                    "id": "139",
                    "question": "What am I willing to do to make our dialogue better this week? HDIFAMA?"
                },
                {
                    "id": "140",
                    "question": "What areas do I most like to dialogue about?"
                },
                {
                    "id": "141",
                    "question": "How has dialogue made you more important in my life?"
                }
            ]
        },
        {
            "id": "6",
            "category": "Dreams",
            "plan": "1",
            "priority": "6",
            "questions": [
                {
                    "id": "142",
                    "question": "What is my dream for our involvement in Retrouvaille? HDIF sharing this with  you?"
                },
                {
                    "id": "143",
                    "question": "What dreams do I have for this year? Are they realistic? HDIFAMA?"
                },
                {
                    "id": "144",
                    "question": "Do I have any dreams that I have not shared with you? HDIF sharing this with  you?"
                },
                {
                    "id": "145",
                    "question": "What were the dreams we had for our children? HDIFAMA?"
                },
                {
                    "id": "146",
                    "question": "What are my dreams for us as we grow older? HDIFAMA?"
                },
                {
                    "id": "147",
                    "question": "What family atmosphere do I dream of for our home? HIDFAMA?"
                },
                {
                    "id": "148",
                    "question": "What are my dreams for our sexual relationship? HDIF telling you this?"
                },
                {
                    "id": "149",
                    "question": "What dream do I have for Retrouvaille in our area? HDIFAMA?"
                },
                {
                    "id": "150",
                    "question": "When God made me, what do I think were His dreams for me? HDMAMMF?"
                }
            ]
        },
        {
            "id": "7",
            "category": "Emotions",
            "plan": "1",
            "priority": "7",
            "questions": [
                {
                    "id": "151",
                    "question": "How do I feel when you are too tired to respond to me?"
                },
                {
                    "id": "152",
                    "question": "How do I feel when I reveal my thoughts and feelings to you on an issue, and  you respond as I expected you to? Describe in loving detail."
                },
                {
                    "id": "153",
                    "question": "How do I feel when I fail at something? Describe in loving detail."
                },
                {
                    "id": "154",
                    "question": "How do I feel when we are on a trip and get a flat tire? Describe in loving  detail."
                },
                {
                    "id": "155",
                    "question": "How do I feel when we are lost? Describe in loving detail."
                },
                {
                    "id": "156",
                    "question": "How do I feel when I/you have an accident? Describe in loving detail."
                },
                {
                    "id": "157",
                    "question": "How do I feel when I try to hold in my.... (anger, joy, disappointment, etc.)?  Describe in loving detail."
                },
                {
                    "id": "158",
                    "question": "How do I feel when I find out, after the fact, that someone has lied to me?  Describe in loving detail."
                },
                {
                    "id": "159",
                    "question": "How do I act (behave) when I am upset (angry or mad) with you? HDIF sharing  this with you?"
                },
                {
                    "id": "160",
                    "question": "Do I keep my pain, hurt, or disillusionment to myself? Why? HDIF sharing this  with you?"
                },
                {
                    "id": "161",
                    "question": "It is difficult to write about feelings. HDTMMF?"
                },
                {
                    "id": "162",
                    "question": "HDIF when I am given advice by others that I did not ask for?"
                },
                {
                    "id": "163",
                    "question": "HDIF when I realize that I am responsible for my own feelings?"
                },
                {
                    "id": "164",
                    "question": "HDIF when my plans for the day, a project an outing, etc., are disrupted?  Describe your feelings in loving detail."
                },
                {
                    "id": "165",
                    "question": "HDIF when you bring up past hurts?"
                },
                {
                    "id": "166",
                    "question": "In what areas/ways do I think I am taken for granted for? HDIF about telling  you this?"
                },
                {
                    "id": "167",
                    "question": "What disappointments have I kept to myself? HDIF sharing this with you now?"
                },
                {
                    "id": "168",
                    "question": "What things, actions, ideas, do I find the most threatening? HDIFAT?"
                },
                {
                    "id": "169",
                    "question": "How am I hard on myself for things I've done in the past? HDIFAMA?"
                },
                {
                    "id": "170",
                    "question": "How does success affect my self image? HDIFAMA?"
                },
                {
                    "id": "171",
                    "question": "How does failure affect my self image? HDIFAMA?"
                },
                {
                    "id": "172",
                    "question": "More people would learn from their mistakes if they weren't so busy denying  them.'  Harold J. Smith Do I deny my mistakes or do I learn from them? HDTMMF?"
                },
                {
                    "id": "173",
                    "question": "What feeling in myself do I have the hardest time accepting and why? HDIF  telling you this?"
                },
                {
                    "id": "174",
                    "question": "Am I smiling more now than I was three months ago? HDIFAMA?"
                },
                {
                    "id": "175",
                    "question": "HDIF when you greet me warmly after a tough day?"
                },
                {
                    "id": "176",
                    "question": "HDIF when I share an uncomfortable feeling with you?"
                },
                {
                    "id": "177",
                    "question": "HDIF when I see a characteristic of yours in one of our children?"
                },
                {
                    "id": "178",
                    "question": "HDIF knowing that today could be our last day to love?"
                },
                {
                    "id": "179",
                    "question": "HDIF about us when we hear our favorite song?"
                },
                {
                    "id": "180",
                    "question": "HDIF when you lost your patience with me?"
                },
                {
                    "id": "181",
                    "question": "HDIF when I am watching you and you don't know it?"
                },
                {
                    "id": "182",
                    "question": "HDIF when you give me a sincere compliment?"
                },
                {
                    "id": "183",
                    "question": "HDIF rereading your 90/90 loveletter from our weekend?"
                },
                {
                    "id": "184",
                    "question": "HDIF when I think you are paying more attention to others than to me?"
                },
                {
                    "id": "185",
                    "question": "HDIF when you put the children ahead of us?"
                },
                {
                    "id": "186",
                    "question": "Do I still judge you and try to change your feelings in touchy areas? HDMAMMF?"
                },
                {
                    "id": "187",
                    "question": "What is my greatest fear about my death? HDTMMF?"
                },
                {
                    "id": "188",
                    "question": "When I realize I have hurt you, what are my feelings?"
                },
                {
                    "id": "189",
                    "question": "When I think about living without you, what are my feelings?"
                },
                {
                    "id": "190",
                    "question": "When you are passionate, what are my feelings? HDIF sharing this with you?"
                },
                {
                    "id": "191",
                    "question": "When I know you are praying for me, what are my feelings?"
                },
                {
                    "id": "192",
                    "question": "HDIF when we pray together?"
                },
                {
                    "id": "193",
                    "question": "HDIF about having God in our relationship?"
                },
                {
                    "id": "194",
                    "question": "HDIF when you express need for leisure time?"
                },
                {
                    "id": "195",
                    "question": "HDIF when we receive communion together?"
                },
                {
                    "id": "196",
                    "question": "In what way has our acceptance of each other created a new world for us? What  are my feelings about that?"
                },
                {
                    "id": "197",
                    "question": "HDIF about your openness to me in our lovemaking?"
                },
                {
                    "id": "198",
                    "question": "HDIF when I am naked in front of you?"
                },
                {
                    "id": "199",
                    "question": "Do I think I release my anger and frustration appropriately or inappropriately?  HDIFAMA?"
                },
                {
                    "id": "200",
                    "question": "What am I most disillusioned with in my life? HDIFAMA?"
                },
                {
                    "id": "201",
                    "question": "Recently, when have I felt the most alone? Describe in loving detail."
                },
                {
                    "id": "202",
                    "question": "How do I feel when I see you crying? Describe in loving detail."
                },
                {
                    "id": "203",
                    "question": "What negative feeling do I experience the most? HDIFAMA?"
                },
                {
                    "id": "204",
                    "question": "How do I feel when you feel hurt? Describe in loving detail."
                },
                {
                    "id": "205",
                    "question": "How do I feel when someone insults one of my ideas? Describe in loving detail."
                },
                {
                    "id": "206",
                    "question": "How would I feel about changing places with you for a day if I could?"
                },
                {
                    "id": "207",
                    "question": "How do I feel when I hear about someone who has been abused? Describe in loving  detail."
                },
                {
                    "id": "208",
                    "question": "How do I feel about making a monetary sacrifice so that others can attend a  weekend? Describe in loving detail."
                },
                {
                    "id": "209",
                    "question": "How do I feel about the role the pastor/priest/rabbi played in our wedding?  Describe in loving detail."
                },
                {
                    "id": "210",
                    "question": "How would I feel if someone threw a rock through one of our windows on purpose?  Describe in loving detail."
                },
                {
                    "id": "211",
                    "question": "How do I feel when we are asked to do something, and I/we say 'yes' when I  would rather say 'no?' Describe in loving detail."
                },
                {
                    "id": "212",
                    "question": "How do I feel about the way I spend my spare time? Describe in loving detail."
                },
                {
                    "id": "213",
                    "question": "Lately, have I accepted your feelings, merely tolerated them, or rejected them?  HDIFAMA?"
                },
                {
                    "id": "214",
                    "question": "Lately, my biggest disappointment has been... HDIFAT (besides disappointed)?"
                },
                {
                    "id": "215",
                    "question": "How do I feel when I realize I've done something thoughtless and hurt you?  Describe in loving detail."
                },
                {
                    "id": "216",
                    "question": "The thing I most fear is... HDIF sharing this with you?"
                },
                {
                    "id": "217",
                    "question": "How would I feel about the idea of having to spend Christmas without you?  Describe in loving detail."
                },
                {
                    "id": "218",
                    "question": "How do I feel being around a room full of children? Describe in loving detail."
                },
                {
                    "id": "219",
                    "question": "How do I feel about all the Holiday bustle? Describe in loving detail."
                },
                {
                    "id": "220",
                    "question": "Are there any hurts between us that I need to be healed of before our  relationship can continue to grow? HDIFAMA?"
                },
                {
                    "id": "221",
                    "question": "How do I feel about the way we spend our Holidays? Describe in loving detail."
                },
                {
                    "id": "222",
                    "question": "How do I feel about our current level of involvement with our families?  Describe in loving detail."
                },
                {
                    "id": "223",
                    "question": "How do I feel about our involvement with our church and the activities there?  Describe in loving detail."
                },
                {
                    "id": "224",
                    "question": "How do I feel about your/my/our involvment with work? Describe in loving  detail."
                },
                {
                    "id": "225",
                    "question": "How do I feel when we cry after watching a movie together? Describe in loving  detail."
                },
                {
                    "id": "226",
                    "question": "How do I feel when we have to work together on a project? Describe in loving  detail."
                },
                {
                    "id": "227",
                    "question": "What are me feelings knowing that that somewhere, there is a weekend going on  right now? HDIF sharing this with you?"
                },
                {
                    "id": "228",
                    "question": "What are my feelings about this week in the modern world? HDIF sharing this  with you?"
                },
                {
                    "id": "229",
                    "question": "How do I feel when you laugh at me? HDIFTYT (How Do I Feel Telling You This)?"
                },
                {
                    "id": "230",
                    "question": "What feeling is most likely to be the source of my anger? Describe the feeling  in loving detail."
                },
                {
                    "id": "231",
                    "question": "How do I feel when you feel hurt? Describe in loving detail."
                },
                {
                    "id": "232",
                    "question": "How would I feel about changing places with you for a day if I could?"
                },
                {
                    "id": "233",
                    "question": "How do I feel when I hear about someone who has been abused? Describe in loving  detail."
                },
                {
                    "id": "234",
                    "question": "When lately did I judge my feeling(s) was one(s) I should not have? Why?  Describe the feeling in loving detail."
                },
                {
                    "id": "235",
                    "question": "I judge I cry... (freely, rarely, easily, etc.) What is _most_ likely to result  in me crying? HDIFAMA?"
                },
                {
                    "id": "236",
                    "question": "Even though our masks are a barrier in our relationship, there is a reason we  where them. They give us strength to deal with the world. If we can identify the  strengths our mask give us, we can retain them when we lower the masks to be  ourselves with our spouses. What strengths do I have because of the mask I wear?  HDIFAMA?"
                },
                {
                    "id": "237",
                    "question": "What limits do I have because of the mask I wear? HDIFAMA?"
                },
                {
                    "id": "238",
                    "question": "How does my mask cause me to be a married single? HDIFAMA?"
                },
                {
                    "id": "239",
                    "question": "What fears do I have of growing old? HDIF sharing this with you?"
                },
                {
                    "id": "240",
                    "question": "Do I consider myself an optimist, pessimist, or realist? HDIF feel sharing this  with you?"
                },
                {
                    "id": "241",
                    "question": "How do I feel when you bring me a surprise? Describe in loving detail."
                },
                {
                    "id": "242",
                    "question": "When am I most frustrated with you? HDIF sharing this with you?"
                },
                {
                    "id": "243",
                    "question": "On the weekend we heard that feelings are neither right nor wrong. What was  your reaction to hearing this on your weekend? What is your reaction today?  HDYAMMF?"
                },
                {
                    "id": "244",
                    "question": "What was your strongest feeling today?\" HDIFAT?"
                },
                {
                    "id": "245",
                    "question": "When I reflect on what a gift you are to me, I feel ____ ? HDTMMF?"
                },
                {
                    "id": "246",
                    "question": "What feeling haven't I shared with you this week because I thought you wouldn't  accept me?\" HDIFAMA?"
                },
                {
                    "id": "247",
                    "question": "To become more fully human and lovable and at the same time achieve a greater  growth in my married life, how can I stop hiding my emotions? HDIFAMA?"
                },
                {
                    "id": "248",
                    "question": "To become more fully human and lovable and at the same time achieve a greater  growth in my married life, how can I stop holding onto my fears? HDMAMMF?"
                },
                {
                    "id": "249",
                    "question": "I am most vulnerable when... HDIF sharing this with you?"
                },
                {
                    "id": "250",
                    "question": "I am most confident when... HDIF sharing this with you?"
                },
                {
                    "id": "251",
                    "question": "How do I feel when you say \"no\" to me? Describe in loving detail."
                },
                {
                    "id": "252",
                    "question": "I feel rejected most when... Describe in loving detail."
                },
                {
                    "id": "253",
                    "question": "I feel the loneliest when... HDIF telling you this?"
                },
                {
                    "id": "254",
                    "question": "Do I hide my true feelings from others? HDIFAMA?"
                },
                {
                    "id": "255",
                    "question": "How do I feel going out alone at night? Describe in loving detail."
                },
                {
                    "id": "256",
                    "question": "Do I consider your feelings when making decisions that affect you? HDIFAMA?"
                },
                {
                    "id": "257",
                    "question": "Thinking about retirement, I feel... Describe in loving detail."
                },
                {
                    "id": "258",
                    "question": "What feelings do I experience when I share with you? HDMAMMF?"
                },
                {
                    "id": "259",
                    "question": "How do I handle my jealous feelings? How could I handle them more  constructively? HDMAMMF?"
                },
                {
                    "id": "260",
                    "question": "How do I feel about the concept, 'Let go and let God'? HDMAMMF?"
                },
                {
                    "id": "261",
                    "question": "How do I feel when my priorities and actions are inconsistent with each other?  HDMAMMF?"
                },
                {
                    "id": "262",
                    "question": "What are my feelings when I receive my partner's personal reflection and  dialogue? HDMAMMF?"
                },
                {
                    "id": "263",
                    "question": "What am I doing to bring joy to our relationship? HDMAMMF"
                },
                {
                    "id": "264",
                    "question": "What makes me feel most united or coupled? HDIFAT?"
                },
                {
                    "id": "265",
                    "question": "How do I feel when I hear there is a big storm coming and you are not home?  Describe in loving detail."
                },
                {
                    "id": "266",
                    "question": "How do I feel when I see you suffering? Describe in loving detail."
                },
                {
                    "id": "267",
                    "question": "How do I feel when I want to spend time with you, but you do want to/are too  busy/etc.? Describe in loving detail."
                },
                {
                    "id": "268",
                    "question": "How do I feel about our church? Describe in loving detail."
                },
                {
                    "id": "269",
                    "question": "How do I feel about our home? Describe in loving detail."
                },
                {
                    "id": "270",
                    "question": "How do I feel about our dialog? Describe in loving detail."
                },
                {
                    "id": "271",
                    "question": "How do I feel about the coming Holidays? Describe in loving detail."
                },
                {
                    "id": "272",
                    "question": "How do I feel about where we are this year compared to last year at this time?  Describe in loving detail."
                },
                {
                    "id": "273",
                    "question": "How do I feel about my home? Describe in loving detail."
                },
                {
                    "id": "274",
                    "question": "How do I feel about my dialog? Describe in loving detail."
                },
                {
                    "id": "275",
                    "question": "How do I feel about the coming Holidays? Describe in loving detail."
                },
                {
                    "id": "276",
                    "question": "How do I feel about where I am this year compared to last year at this time?  Describe in loving detail."
                },
                {
                    "id": "277",
                    "question": "How do I feel when I lose control over a situation? Describe in loving detail."
                },
                {
                    "id": "278",
                    "question": "How do I feel when someone is making fun of me? Describe in loving detail."
                },
                {
                    "id": "279",
                    "question": "How do I feel when I have to apologize even when I don't think I did anything  wrong? Describe in loving detail."
                },
                {
                    "id": "280",
                    "question": "I have difficulity sharing my feelings about _____. HDTMMF?"
                },
                {
                    "id": "281",
                    "question": "What are two specific areas in which I tolerate your feelings and how does this  generally cause me to act? HDMAMMF?"
                },
                {
                    "id": "282",
                    "question": "What area is difficult for me to share my feelings about? HDIFTYT?"
                },
                {
                    "id": "283",
                    "question": "When over the last week did I not accept your feelings? HDIF telling you this  now?"
                },
                {
                    "id": "284",
                    "question": "How do I feel when someone points out my failure or weakness in front of  others? DILD."
                },
                {
                    "id": "285",
                    "question": "When you feel threatened, I feel... DILD."
                },
                {
                    "id": "286",
                    "question": "How would I feel if someone else read my notebook? DILD."
                },
                {
                    "id": "287",
                    "question": "When others misjudge me, I feel... DILD."
                },
                {
                    "id": "288",
                    "question": "HDIF when I think I have hurt your feelings?"
                },
                {
                    "id": "289",
                    "question": "In what area do I most admire or respect your feelings?"
                },
                {
                    "id": "290",
                    "question": "HDIF when I reveal my innermost emotions to you?"
                },
                {
                    "id": "291",
                    "question": "HDIF when you seem annoyed with me?"
                },
                {
                    "id": "292",
                    "question": "What are my feelings as we begin this week? HDIFTYT?"
                },
                {
                    "id": "293",
                    "question": "How do your insecurities affect me? HDMAMMF?"
                },
                {
                    "id": "294",
                    "question": "What is the most difficult emotion/feeling I've shared with you recently?"
                },
                {
                    "id": "295",
                    "question": "HDIF about planning a holiday with you?"
                },
                {
                    "id": "296",
                    "question": "HDIF when I am alone?"
                },
                {
                    "id": "297",
                    "question": "When I am lonely, I think of _________ . HDMAMMF?"
                },
                {
                    "id": "298",
                    "question": "HDIF when I make encouraging comments to you?"
                },
                {
                    "id": "299",
                    "question": "HDIF when I see thanks' shining in your eyes?"
                },
                {
                    "id": "300",
                    "question": "HDIF about starting over again after a failure?"
                },
                {
                    "id": "301",
                    "question": "HDIF about revealing my negative emotions?"
                },
                {
                    "id": "302",
                    "question": "HDIF when you are late coming home from work?"
                },
                {
                    "id": "303",
                    "question": "Change makes me feel ________."
                },
                {
                    "id": "304",
                    "question": "HDIF realizing my attitudes and judgments have caused you pain?"
                },
                {
                    "id": "305",
                    "question": "Do I really believe that feelings are neither right nor wrong?"
                },
                {
                    "id": "306",
                    "question": "How would I feel tracing your face with my fingertips?"
                },
                {
                    "id": "307",
                    "question": "HDIF when we are intimate?"
                },
                {
                    "id": "308",
                    "question": "What kind of things frustrate me? HDIF when it happens?"
                },
                {
                    "id": "309",
                    "question": "Star bright nights stir feelings in me of ____."
                },
                {
                    "id": "310",
                    "question": "HDIF about your smile?"
                },
                {
                    "id": "311",
                    "question": "HDIF when we share deeply with those around us?"
                },
                {
                    "id": "312",
                    "question": "HDIF when you seem to appreciate me?"
                },
                {
                    "id": "313",
                    "question": "In what ways am I afraid to look ahead? HDMAMMF?"
                },
                {
                    "id": "314",
                    "question": "HDIF about going to bed angry?"
                },
                {
                    "id": "315",
                    "question": "I would feel special if _______ . DYFID"
                },
                {
                    "id": "316",
                    "question": "HDIF when I judge myself as inadequate, guilty, or unlovable?"
                },
                {
                    "id": "317",
                    "question": "HDIF when I react rather than respond to you?"
                },
                {
                    "id": "318",
                    "question": "Do I give and get enough emotional support? HDMAMMF?"
                },
                {
                    "id": "319",
                    "question": "In what ways do I feel I am taken for granted? HDIFAMA?"
                },
                {
                    "id": "320",
                    "question": "HDIF when you shut me off?"
                },
                {
                    "id": "470",
                    "question": "When I am hurting, I appreciate when you __________."
                }
            ]
        },
        {
            "id": "8",
            "category": "Expectations",
            "plan": "1",
            "priority": "8",
            "questions": [
                {
                    "id": "321",
                    "question": "What would I like to get accomplished this week? HDIFAMA?"
                },
                {
                    "id": "322",
                    "question": "Am I satisfied with my life? (What would I change? What wouldn't I change?)  HDIFAM answer(s)?"
                },
                {
                    "id": "323",
                    "question": "HDIF when you are sick and all of the family responsibilities fall on me?"
                },
                {
                    "id": "324",
                    "question": "What expectations do I have for my/our Retrouvaille involvement? Are they being  met? HDIFAMA?"
                },
                {
                    "id": "325",
                    "question": "What expectations do I have of my family?"
                },
                {
                    "id": "326",
                    "question": "What expectations do I have of your family?"
                },
                {
                    "id": "327",
                    "question": "What expectations do I have of our family?"
                },
                {
                    "id": "328",
                    "question": "What expectations do I have of our children?"
                },
                {
                    "id": "329",
                    "question": "What expectations do I have concerning our finances? Are they being met?  HDIFAMAs?"
                },
                {
                    "id": "330",
                    "question": "What are my expectations concerning our love making? Are they being met?  Hdifama?"
                },
                {
                    "id": "331",
                    "question": "What expectations do I have of my/your job? Are they being met? HDIFAMAs?"
                },
                {
                    "id": "332",
                    "question": "What expectations of myself do I have? Do I live up to them, or not? HDIFAMA?"
                },
                {
                    "id": "333",
                    "question": "What expectations do I have of you? Are my expectations being met? HDIFsharing  this with you?"
                },
                {
                    "id": "334",
                    "question": "What expectations do I have of God? Are they being met? HDIFAMA?"
                },
                {
                    "id": "335",
                    "question": "What expectation(s) of mine was not met this last week? HDIFAMA?"
                },
                {
                    "id": "336",
                    "question": "What expectations do I have for Valentine's day? HDIFA sharing this with you?"
                },
                {
                    "id": "337",
                    "question": "How do I feel when you do not share your plans with me? Describe in loving  detail."
                },
                {
                    "id": "338",
                    "question": "Where would I like to be next year at this time? HDIFAMA?"
                },
                {
                    "id": "339",
                    "question": "How do I feel when I realize that I am not who you thought me to be? Describe  in loving detail."
                },
                {
                    "id": "340",
                    "question": "What goal would I like to achive in the next few months? HDIFAMA?"
                },
                {
                    "id": "341",
                    "question": "How do I feel when I judge I let you/others down? Describe in loving detail."
                },
                {
                    "id": "342",
                    "question": "Do we have a role to fulfill in other couples' relationships? HDIFAMA?"
                },
                {
                    "id": "343",
                    "question": "What does the New Year mean to me? HDIFAMA?"
                },
                {
                    "id": "344",
                    "question": "Even though you might not expect it, what changes do I need to make in my  behavior that will help me grow closer to you?\" HDMAMMF?"
                },
                {
                    "id": "345",
                    "question": "Do my selfish desires create obstacles in our relationship? HDIFAMA?"
                },
                {
                    "id": "346",
                    "question": "Do my personal goals conflict with our goals? HDIFAMA?"
                },
                {
                    "id": "347",
                    "question": "How do I feel when you tell me, 'We'll see,' and I think you really mean, 'No'?  DILD."
                },
                {
                    "id": "348",
                    "question": "What goals would I like us to achieve this month? HDIFAT?"
                },
                {
                    "id": "349",
                    "question": "What are my hopes for our future together? HDIFAMA?"
                },
                {
                    "id": "350",
                    "question": "What was my loneliest time this past week? HDIFTYT?"
                },
                {
                    "id": "351",
                    "question": "HDIF when you expect more of me than I am capable of giving right now?"
                },
                {
                    "id": "352",
                    "question": "Would I feel better keeping weekends relatively unplanned?"
                },
                {
                    "id": "353",
                    "question": "Why did we join a support group? HDIFAT now?"
                },
                {
                    "id": "354",
                    "question": "Do I accept your ambitions? Do I think you accept mine? HDIFAT?"
                },
                {
                    "id": "355",
                    "question": "HDIF when my plans run off the track?"
                },
                {
                    "id": "356",
                    "question": "How can we live a simple and more fulfilling life? HDIFTYT?"
                },
                {
                    "id": "357",
                    "question": "HDIF when I fail to accomplish something I set out to do?"
                },
                {
                    "id": "358",
                    "question": "What would I like to accomplish this summer?"
                },
                {
                    "id": "359",
                    "question": "When others expect a lot from me, I feel ______ and tend to ______ . HDTMMF?"
                },
                {
                    "id": "360",
                    "question": "What hinders us from making better decisions? HDIFAT?"
                }
            ]
        },
        {
            "id": "9",
            "category": "Family of Origin",
            "plan": "1",
            "priority": "9",
            "questions": [
                {
                    "id": "361",
                    "question": "How do I feel when we spend a day with our extended families? Describe in  loving detail."
                },
                {
                    "id": "362",
                    "question": "As a child, who was I closest too, and why? HDIF sharing this with you?"
                },
                {
                    "id": "363",
                    "question": "Do I (Did I) love my parents just because I respect them for all they've done  (did) for me, or is there more to it? HDIFAMA?"
                },
                {
                    "id": "364",
                    "question": "How do I feel about spending time with your/my family? Describe in loving  detail."
                },
                {
                    "id": "365",
                    "question": "How do my childhood dreams of growing up compare to what I am now? HDIFAT?"
                },
                {
                    "id": "366",
                    "question": "How do I feel about our current level of involvement with our families?  Describe in loving detail."
                },
                {
                    "id": "367",
                    "question": "How are my parents still influencing my life? HDIFAMA?"
                },
                {
                    "id": "368",
                    "question": "One thing I missed out on in my childhood was... HDIFAMA?"
                },
                {
                    "id": "369",
                    "question": "How well do I live up to the dreams I had for myself when I was young?  HDIFAMA?"
                },
                {
                    "id": "370",
                    "question": "Do I harbor hurts, grudges, or hard feelings from past injuries? HDIFAMA?"
                },
                {
                    "id": "371",
                    "question": "What does Valentine's day mean to me? HDIF sharing this with you?"
                },
                {
                    "id": "372",
                    "question": "What expectations do I have for Valentine's day? HDIFA sharing this with you?"
                },
                {
                    "id": "373",
                    "question": "What effect has growing up experiencing my parents' relationship had on our  relationship? What good things have come from it? HDIFAMA?"
                },
                {
                    "id": "374",
                    "question": "What effect has growing up experiencing my parents' relationship had on our  relationship? What not so good things have come from it? HDIFAMA?"
                },
                {
                    "id": "375",
                    "question": "Do I see myself living the same as my parents or differently? HDMAMMF?"
                },
                {
                    "id": "376",
                    "question": "How do I feel remembering a time when I was in trouble as a child? HDIF sharing  this with you?"
                },
                {
                    "id": "377",
                    "question": "Who in my childhood most affected my life? HDTMMF?"
                },
                {
                    "id": "378",
                    "question": "How does my/our relationship with my/your parents affect us? HDIFAT? (You may  want to pick one set of parents the first night, and the other the following  night.)"
                },
                {
                    "id": "379",
                    "question": "Do I spend enought time with relatives? HDIFAMA?"
                },
                {
                    "id": "380",
                    "question": "HDIF when I realize my spouse's family's problems become my problems & vice  versa?\" HDIFTYT?"
                },
                {
                    "id": "381",
                    "question": "What are my feelings when my family's aging and health related problems become  our concern? HDIFTYT?"
                },
                {
                    "id": "382",
                    "question": "Am I afraid that my parent's health problems (Alzheimer's, osteoporosis, heart  disease) will eventually manifest in me as I age? HDIFTYT?"
                },
                {
                    "id": "383",
                    "question": "How have our in laws contributed positive/negative change to our family?  HDIFAT?"
                },
                {
                    "id": "384",
                    "question": "When was the last time I thanked my mother for being a mom?"
                },
                {
                    "id": "385",
                    "question": "We are blessed by the love of our families. HDIFAT?"
                },
                {
                    "id": "386",
                    "question": "Am I more like my mother or my father? HDIFAT?"
                }
            ]
        },
        {
            "id": "10",
            "category": "Forgiveness",
            "plan": "1",
            "priority": "10",
            "questions": [
                {
                    "id": "387",
                    "question": "How do I feel when I say to you, 'Please forgive me. I was wrong.' Describe in  loving detail."
                },
                {
                    "id": "388",
                    "question": "Is there anything you've done that I have not forgiven you for? Why? How do I  feel about my answer?"
                },
                {
                    "id": "389",
                    "question": "What have I done recently that I should ask you for forgiveness, but have not?  HDIF sharing this with you?"
                },
                {
                    "id": "390",
                    "question": "After a fight, is it easy or hard for me to ask for forgiveness? Why? HDIFAMA?"
                },
                {
                    "id": "391",
                    "question": "What is my biggest barrier to forgiving you when I feel hurt? HDIFAMA?"
                },
                {
                    "id": "392",
                    "question": "What do I find hardest to forgive in myself? HDIFAMA?"
                },
                {
                    "id": "393",
                    "question": "How do I feel after I have forgiven you? Describe in loving detail."
                },
                {
                    "id": "394",
                    "question": "No offense by another person could possibly equal our guilt before God, yet He  has forgiven us; are we not obligated to show the same mercy to others? HTMMF?"
                },
                {
                    "id": "395",
                    "question": " What have you done that I have not  forgiven you for? HDTMMF?"
                },
                {
                    "id": "396",
                    "question": "To become more fully human and lovable and at the same time achieve a greater  growth in my married life, how can I be more gentle with myself?\" HDMAMMF?"
                },
                {
                    "id": "397",
                    "question": "How have I experienced forgiveness in our relationship? HDTMMF?\" \"What do you  do that tells me you forgive me? How do I feel afterwards?"
                },
                {
                    "id": "398",
                    "question": "How do I feel after I have forgiven you? DILD."
                },
                {
                    "id": "399",
                    "question": "What do you do that tells me you forgive me? How do I feel afterwards?"
                },
                {
                    "id": "400",
                    "question": "How do I feel after I have forgiven you? DILD."
                },
                {
                    "id": "401",
                    "question": "Are we having a lifestyle of forgiveness and healing? HDMAMMF?"
                },
                {
                    "id": "402",
                    "question": "Is one of us always the first to forgive? HDIFAT?"
                },
                {
                    "id": "403",
                    "question": "HDIF about forgiving and being forgiven?"
                },
                {
                    "id": "404",
                    "question": "What is the most effective way to communicate forgiveness?"
                },
                {
                    "id": "405",
                    "question": "What makes it hard to ask for forgiveness? HDIFAT?"
                },
                {
                    "id": "406",
                    "question": "When God forgives me, why can't I forgive myself? DYFILD."
                },
                {
                    "id": "407",
                    "question": "HDIF about the advice, forgive and forget'?"
                },
                {
                    "id": "408",
                    "question": "HDIF when you apologize to me?"
                },
                {
                    "id": "409",
                    "question": "HDIF when you ask for my forgiveness?"
                },
                {
                    "id": "410",
                    "question": "What is the most effective way I can communicate forgiveness?"
                },
                {
                    "id": "411",
                    "question": "Are we having a lifestyle of forgiveness and healing? HDMAMMF?"
                },
                {
                    "id": "412",
                    "question": "Is one of us always the first to forgive? HDIFAT?"
                },
                {
                    "id": "413",
                    "question": "HDIF about forgiving and being forgiven?"
                },
                {
                    "id": "414",
                    "question": "What is the most effective way to communicate forgiveness?"
                },
                {
                    "id": "415",
                    "question": "What makes it hard to ask for forgiveness? HDIFAT?"
                },
                {
                    "id": "416",
                    "question": "When God forgives me, why can't I forgive myself? DYFILD."
                },
                {
                    "id": "417",
                    "question": "HDIF about the advice, forgive and forget'?"
                },
                {
                    "id": "418",
                    "question": "HDIF when you apologize to me?"
                },
                {
                    "id": "419",
                    "question": "HDIF when you ask for my forgiveness?"
                },
                {
                    "id": "420",
                    "question": "What is the most effective way I can communicate forgiveness?"
                }
            ]
        },
        {
            "id": "11",
            "category": "Friends",
            "plan": "1",
            "priority": "11",
            "questions": [
                {
                    "id": "421",
                    "question": "How do I feel when we have a large number of people over? Describe in loving  detail."
                },
                {
                    "id": "422",
                    "question": "Which Retrouvaille couple do I feel closest to? Why? HDIFAMA?"
                },
                {
                    "id": "423",
                    "question": "HDIF when I am given advice by others, but I did not ask for it? HDIFAMA?"
                },
                {
                    "id": "424",
                    "question": "Is it difficult for us to pray with our friends? HDMAMMF?"
                },
                {
                    "id": "425",
                    "question": "Have we thought about getting together with our friends to pray? HDMAMMF?"
                },
                {
                    "id": "426",
                    "question": "Are we free to ask our friends for help anytime we have a problem? HDIFAMA?"
                },
                {
                    "id": "427",
                    "question": "HDIF about God's plan for our friendships?"
                },
                {
                    "id": "428",
                    "question": "HDIF after a night of entertaining friends in our home?"
                },
                {
                    "id": "429",
                    "question": "What barriers or attitudes do I have that keep me from developing an intimate  relationship with our friends? HDIFAMA?"
                },
                {
                    "id": "430",
                    "question": "'Very few burdens are heavy when everyone lifts.'    unknown author Do we  share our burdens with others to lighten the load, or do we suffer by ourselves?  HDIFAMA?"
                },
                {
                    "id": "431",
                    "question": "Do we share our joys with others, and spread the good news, or do we celebrate  alone? HDIFAMA?"
                },
                {
                    "id": "432",
                    "question": "When was the last time we called our special friends just to tell them we love  them? HDMAMMF?"
                },
                {
                    "id": "433",
                    "question": "What friendship has meant the most to me this week and why (besides spouse)?  HDIFAMA?"
                },
                {
                    "id": "434",
                    "question": "How do I respond to overtures of friendhsip from someone I have already decided  to reject? HDIFAMA?"
                },
                {
                    "id": "435",
                    "question": "Have I told my friends how important they are to me? HDIFAMA?"
                },
                {
                    "id": "436",
                    "question": "Am I more likely to make a few close friends, or many acquaintences? HDIFAMA?"
                },
                {
                    "id": "437",
                    "question": "How important are friendships to the health of our relationship? HDIFAMA?"
                },
                {
                    "id": "438",
                    "question": "Do we make the time to pray with our friends? HDIFAMA?"
                },
                {
                    "id": "439",
                    "question": "How do I feel when I/we receive a phone call from an old friend I/we haven't  talked to in a long time? Describe in loving detail."
                },
                {
                    "id": "440",
                    "question": "What friend(s) of yours would I rather not be around? Why? HDIF sharing this  with you?"
                },
                {
                    "id": "441",
                    "question": "How do I feel when an old friend of yours/mine comes into town and wants to  spend some time with you/me? Describe in loving detail."
                },
                {
                    "id": "442",
                    "question": "How do I feel when someone asks me/us, 'How is your dialogue?' Describe in  loving detail."
                },
                {
                    "id": "443",
                    "question": "Why do I want to dialogue in the area of our friends? HDIFAT?"
                },
                {
                    "id": "444",
                    "question": "What do I hope to gain in the area of our friends? HDIFAT?"
                },
                {
                    "id": "445",
                    "question": "What do I like best about you in the area of our friends? HDIFAT?"
                },
                {
                    "id": "446",
                    "question": "What do I like least about you in the area of our friends? HDIFAT?"
                },
                {
                    "id": "447",
                    "question": "What do I like best about myself in the area of our friends? HDIFAT?"
                },
                {
                    "id": "448",
                    "question": "What do I like least about myself in the area of our friends? HDIFAT?"
                },
                {
                    "id": "449",
                    "question": "What do I like best about us in the area of our friends? HDIFAT?"
                },
                {
                    "id": "450",
                    "question": "What mask do I wear in the area of our friends? HDIFAT?"
                },
                {
                    "id": "451",
                    "question": "When am I least open to listen to you in the area of our friends? HDIFAT?"
                },
                {
                    "id": "452",
                    "question": "In the area of our friends what feeling do I find most difficult to share with  you? Describe feelings in loving detail."
                },
                {
                    "id": "453",
                    "question": "What qualities do I look for in a friend? HDIFAMA?"
                },
                {
                    "id": "454",
                    "question": "What couple, that we know, do I see as important to us and how have they  affected our life? HDTMMF?"
                },
                {
                    "id": "455",
                    "question": "How do I feel about other couples supporting us? HDMAMMF?"
                },
                {
                    "id": "456",
                    "question": "When was a time we received support during our difficult times? HDIFAT?"
                },
                {
                    "id": "457",
                    "question": "Do I spend enought time with friends? HDIFAMA?"
                }
            ]
        },
        {
            "id": "12",
            "category": "Gifts",
            "plan": "1",
            "priority": "12",
            "questions": [
                {
                    "id": "458",
                    "question": "What do I think are our limits as a couple? How do I feel about asking others  for help in these areas?"
                },
                {
                    "id": "459",
                    "question": "What gift that I received from you today am I most thankful for? HDIFSTWY?"
                },
                {
                    "id": "460",
                    "question": "What do I judge to be my greatest weakness? HDIFSTWY?"
                },
                {
                    "id": "461",
                    "question": "Here is a little quote from _Illusions_ by Richard Bach, 'There is no such  thing as a problem without a gift for you in its hands.' HDIFATS?"
                },
                {
                    "id": "462",
                    "question": "What gift have you given me in the last week, two weeks, month, etc., that I have really appreciated? How do I feel sharing this with you? (It can be a kind word at the right time, a hug when it was needed, a phone call, etc. It shouldn't be a material item.)"
                },
                {
                    "id": "463",
                    "question": "What strengths do I think I might have, but I am afraid to try or rely on? HDIFAMA?"
                },
                {
                    "id": "464",
                    "question": "Which of your qualities do I take for granted? Do I compliment you on them?  HDIFAMA?"
                },
                {
                    "id": "465",
                    "question": "What quality in myself have I discovered through your eyes? HDIFAT?"
                },
                {
                    "id": "466",
                    "question": "How do I feel about the phrase, \"Dialogue is my gift of myself to you? Describe  in detail. HDIFTYT?"
                },
                {
                    "id": "467",
                    "question": "How do I feel when you make a special effort to make me feel important?"
                },
                {
                    "id": "468",
                    "question": "God gave you to me. How am I treating His gift to me? HDMAMMF?"
                },
                {
                    "id": "469",
                    "question": "How do I feel when you go out of your way to do something nice for me? Describe  in loving detail."
                },
                {
                    "id": "471",
                    "question": "God gave you to me. How am I treating His gift to me? HDMAMMF?"
                },
                {
                    "id": "472",
                    "question": "What present would I give you today, if I could give you anything? HDTMMF?"
                },
                {
                    "id": "473",
                    "question": "What would you do if you had a magic wand that could grant any wish? HDIFAT?"
                },
                {
                    "id": "474",
                    "question": "How do I feel when you make a special effort to make me feel important? DILD"
                },
                {
                    "id": "475",
                    "question": "How well do I use the talents given to me by God? HDIFAMA?"
                },
                {
                    "id": "476",
                    "question": "How do I feel about the Blessings and Gifts God has given me/us? DILD"
                },
                {
                    "id": "477",
                    "question": "What gifts do I/we have to offer Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "478",
                    "question": "What would I/we personally like to try to help make Retrouvaille better?  HDIFAMA?"
                },
                {
                    "id": "479",
                    "question": "What gift do I have that I rarely use? HDIFAMA?"
                },
                {
                    "id": "480",
                    "question": "When I reflect on what a gift you are to me, I feel... HDTMMF?"
                },
                {
                    "id": "481",
                    "question": "What special features do I see in you that fill me with warmth and tenderness?  HDIF sharing this with you?"
                },
                {
                    "id": "482",
                    "question": "What do I say about you when you are not around? HDIFAMA?"
                },
                {
                    "id": "483",
                    "question": "A time when I/we went the extra mile to help someone out was... How do I feel  recalling this?"
                },
                {
                    "id": "484",
                    "question": "What will I give up or do in the coming year to follow God's plan for us? HDIFAT?"
                },
                {
                    "id": "485",
                    "question": "How do I feel about the time we spend with our family and the quality of it?  What would I like to change if I could? HDFTMMF?"
                },
                {
                    "id": "486",
                    "question": "If I could change one and only one thing about the world, what would it be?  HDIFAMA?"
                },
                {
                    "id": "487",
                    "question": "What talent do I wish I had that I do not? HDIF telling you about this?"
                },
                {
                    "id": "488",
                    "question": "What special gift of myself do I offer to you today? HDIF sharing this with  you?"
                },
                {
                    "id": "489",
                    "question": "What is my favorite gift from you? HDIFAT?"
                },
                {
                    "id": "490",
                    "question": "What prevents me from being generous to you and others? HDIFAT?"
                },
                {
                    "id": "491",
                    "question": "What potentials have you helped me develop? HDMAMMF?"
                },
                {
                    "id": "492",
                    "question": "What do I need from you, my partner, to help me develop my potential? HDMAMMF?"
                },
                {
                    "id": "493",
                    "question": "My most unusual ability/talent is... HDIF sharing this ability/talent with  others?"
                },
                {
                    "id": "494",
                    "question": "What gift of myself have I given to you today? HDIFAMA?"
                },
                {
                    "id": "495",
                    "question": "What gift did I give back to God today? HDIFAMA?"
                },
                {
                    "id": "496",
                    "question": "What attribute/ability/gift of yours am I most proud to share with others? How  do I feel sharing this with you?"
                },
                {
                    "id": "497",
                    "question": "What have I done today to help others? HDIFAMA"
                },
                {
                    "id": "498",
                    "question": "If I could dedicate a song to you today, what would it be and why? HDIF sharing  this with you?"
                },
                {
                    "id": "499",
                    "question": "Have I been critical of you or accepting of you this week? HDMAMMF?"
                },
                {
                    "id": "500",
                    "question": "What do I consider my strengths? HDIF sharing this with you?"
                },
                {
                    "id": "501",
                    "question": "I see you as someone very special because... HDIFSTWY?"
                },
                {
                    "id": "502",
                    "question": "Do I give more than I receive, or receive more than I give? HDIFAMA?"
                },
                {
                    "id": "503",
                    "question": "When was the last time I complemented you? DYFID."
                },
                {
                    "id": "504",
                    "question": "Have I brought healing to you recently? HDIFAT?"
                },
                {
                    "id": "505",
                    "question": "How can you help me realize my good qualities?"
                },
                {
                    "id": "506",
                    "question": "HDIF when I see thanks' shining in your eyes?"
                },
                {
                    "id": "507",
                    "question": "The greatest gift a mother can give to her children is ____ ."
                }
            ]
        },
        {
            "id": "13",
            "category": "God/Theology",
            "plan": "1",
            "priority": "13",
            "questions": [
                {
                    "id": "508",
                    "question": "What do I do that keeps me from being closer to God? HDIFAMA?"
                },
                {
                    "id": "509",
                    "question": "How have I experienced God's love through the people He has placed in my life's  journey? HDTMMF?"
                },
                {
                    "id": "510",
                    "question": "What positive actions will I take to change a pressure into a blessing?  HDIFAMA?"
                },
                {
                    "id": "511",
                    "question": "What have we done this week to help do God's work? HDIFAMA?"
                },
                {
                    "id": "512",
                    "question": "How am I failing to live God's plan for my life? HDIFAT?"
                },
                {
                    "id": "513",
                    "question": "Would I treat God as I did you today? HDMAMMF?"
                },
                {
                    "id": "514",
                    "question": "Our love for each other is a reflection of God's love for us. HDTMMF?"
                },
                {
                    "id": "515",
                    "question": "How do I feel when I realize that God is speaking to me through you?"
                },
                {
                    "id": "516",
                    "question": "How do I feel hearing Jesus say these words to me: 'The gift you have received,  give as a gift.'?"
                },
                {
                    "id": "517",
                    "question": "Jesus is counting on us to make His love believable. HDTMMF?"
                },
                {
                    "id": "518",
                    "question": "Do I go to church to give or to get? HDTMMF?"
                },
                {
                    "id": "519",
                    "question": "God expects us to be our brothers' keeper. HDIFAT?"
                },
                {
                    "id": "520",
                    "question": "Where am I with you and God today? HDIFAT?"
                },
                {
                    "id": "521",
                    "question": "What are my feelings about having God in our relationship?"
                },
                {
                    "id": "522",
                    "question": "Is Jesus/God in my heart, or just in my mind? HDIFAMA?"
                },
                {
                    "id": "523",
                    "question": "What will I give up or do in the coming year, to follow God's plan for us?  HDUFAMA?"
                },
                {
                    "id": "524",
                    "question": "What do I think God wants for us? HDIFAMA?"
                },
                {
                    "id": "525",
                    "question": "What do I judge as the most important things I pray about? HDIF sharing this  with you?"
                },
                {
                    "id": "526",
                    "question": "\" 'God will give us nothing we can't handle.' What this doesn't say is that we  must ask for His loving assistance sometimes (most of the time?). But with His  assistance, we can truly perform wonders! HDTMMF?"
                },
                {
                    "id": "527",
                    "question": "What could I do to help myself understand God better? HDIFAMA?"
                },
                {
                    "id": "528",
                    "question": "What do I see in God that makes me love Him? HDIFAMA?"
                },
                {
                    "id": "529",
                    "question": "HDIFA being (Catholic, Jewish, Lutheran, Methodist, etc?)"
                },
                {
                    "id": "530",
                    "question": "Do I measure myself by God's Standards, or the modern world's standards?  HDIFAMA?"
                },
                {
                    "id": "531",
                    "question": "Do I accept the burdens God has given me, or do I try to overcome in spite of  them? HDIFAMA?"
                },
                {
                    "id": "532",
                    "question": "'Faith goes up the stairs that love has made, and looks out the window which  hope has opened.'  C. H. Spurgeon HDIFA this quote?"
                },
                {
                    "id": "533",
                    "question": "\" 'Four things to learn in life: To think clearly without hurry or confusion; To  love everybody sincerely; To act in everything with the highest motives; To  trust God unhesitatingly.'  Helen Keller HD this quote MMF?"
                },
                {
                    "id": "534",
                    "question": "God often allows our hearts to be broken so that He can beautify our soul.  HDIFA this statement?"
                },
                {
                    "id": "535",
                    "question": "Obedience belongs to us; results belong to God. HDTMMF?"
                },
                {
                    "id": "536",
                    "question": "'God is kind and merciful, slow to get angry, and full of love.'    Psalms  145:8. Am I to others as God is to me? HDIFAMA?"
                },
                {
                    "id": "537",
                    "question": "Do I go to church to give or to get? HDTMMF?"
                },
                {
                    "id": "538",
                    "question": "God expects us to be our brothers' keeper. HDIFAT?"
                },
                {
                    "id": "539",
                    "question": "HDIF when I realize that God is speaking to me through you?"
                },
                {
                    "id": "540",
                    "question": "HDIF hearing Jesus say these words to me 'The gift you have received, give as a  gift.'?"
                },
                {
                    "id": "541",
                    "question": "How do I see God reflected through our minister, pastor, priest, or rabii?  HDIFAMA?"
                },
                {
                    "id": "542",
                    "question": "How can we make God more present in our dialogue? HDIFAMA?"
                },
                {
                    "id": "543",
                    "question": "Am I still striving for a deeper more loving relationship with God, or have I  stopped because I judge I've done enough? HDIFAMA?"
                },
                {
                    "id": "544",
                    "question": "How well do I think I show my love to God? HDIFAMA?"
                },
                {
                    "id": "545",
                    "question": "\" 'We should give God the same place in our hearts that He holds in the  universe.'    Anonymous Where is God's place in my heart? HDIFAMA?"
                },
                {
                    "id": "546",
                    "question": "What can I do to make God a bigger part of our life? HDIFAMA?"
                },
                {
                    "id": "547",
                    "question": "Is Jesus/God in my heart, or just in my mind? HDIFAMA?"
                },
                {
                    "id": "548",
                    "question": "\" 'It is a well known fact that a child identifies his parents with God,  whether or not the adults want that role.'  The Strong Willed Child, p 171. What  are my feelings on this passage? How do I feel being God to our children? HDIF  sharing this with you?"
                },
                {
                    "id": "549",
                    "question": "In what ways am I willing to purify myself to become Holy? HDIFAT?"
                },
                {
                    "id": "550",
                    "question": "What are my feelings about the Trinity of God?\" HDIFAT?"
                },
                {
                    "id": "551",
                    "question": "Where do I believe God has called us in ministry as a couple? HDIFAMA?"
                },
                {
                    "id": "552",
                    "question": "My prayers are answered in God's time not my time. HDTMMF?"
                },
                {
                    "id": "553",
                    "question": "How do I feel when I realize that God has spoken to me through you? Describe in  loving detail."
                },
                {
                    "id": "554",
                    "question": "He is Risen! How does this make me feel?"
                },
                {
                    "id": "555",
                    "question": "Jesus would have died for me even if I was the only person on earth. HDIFAT?"
                },
                {
                    "id": "556",
                    "question": "Would I have been able to stay at the Garden of Gethsemane knowing what was  going to happen? HDIFAMA?"
                },
                {
                    "id": "557",
                    "question": "How would I feel if one of my family decided to become a  priest/minister/rabbi/etc.? Describe in loving detail."
                },
                {
                    "id": "558",
                    "question": "\" 'A closed heart can only be opened from the inside.' Is my heart fully open to  you? If not, where do I need to improve? HDIFAMA?"
                },
                {
                    "id": "559",
                    "question": "How do I feel about discussing religon with someone who's views differ from  mine? Describe in loving detail."
                },
                {
                    "id": "560",
                    "question": "If I could convince people of only one aspect of Jesus' message what would it  be? HDIFAMA?"
                },
                {
                    "id": "561",
                    "question": "Why do I want to dialogue in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "562",
                    "question": "What do I hope to gain in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "563",
                    "question": "What do I like best about you in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "564",
                    "question": "What do I like least about you in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "565",
                    "question": "What do I like best about myself in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "566",
                    "question": "What do I like least about myself in the area of God and our faith?"
                },
                {
                    "id": "567",
                    "question": "What do I like best about us in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "568",
                    "question": "What mask do I wear in the area of money? HDIFAT?"
                },
                {
                    "id": "569",
                    "question": "When am I least open to listen to you in the area of God and our faith? HDIFAT?"
                },
                {
                    "id": "570",
                    "question": "In the area of God and our faith what feeling do I find most difficult to share  with you? Describe feelings in loving detail."
                },
                {
                    "id": "571",
                    "question": "What Christ/God like qualities do I see in you? HDIF sharing this with you?"
                },
                {
                    "id": "572",
                    "question": "The priest/religious/minister/etc. that has most helped me/us to experience  God's love for us is/was... HDIFAMA?"
                },
                {
                    "id": "573",
                    "question": "The couple that has most helped me/us to experience God's love for me/us  is/was... HDIFAMA?"
                },
                {
                    "id": "574",
                    "question": "When something bad happens to me do I allow it to effect our relationship  and/or my relationship with God? HDIFAMA?"
                },
                {
                    "id": "575",
                    "question": "What is my idea of heaven? HDIFAT?"
                },
                {
                    "id": "576",
                    "question": "What is our relationship with God, today? HDMAMMF?"
                },
                {
                    "id": "577",
                    "question": "Do I wish to deepen the experience of God in our relationship? If so, how?  HDMAMMF?"
                },
                {
                    "id": "578",
                    "question": "Do we serve the world or God? HDIFAMA?"
                },
                {
                    "id": "579",
                    "question": "What gift did I give back to God today? HDIFAMA?"
                },
                {
                    "id": "580",
                    "question": "How does the redemptive power of Jesus Christ in my life make me feel about my  past (your past)?"
                },
                {
                    "id": "581",
                    "question": "When did I feel closest to God and you in our lovemaking? HDIF sharing this  with you?"
                },
                {
                    "id": "582",
                    "question": "Do I think God led me to Retrouvaille or Retrouvaille led me to God? HDMAMMF?"
                },
                {
                    "id": "583",
                    "question": "When God made me, what do I think were His dreams for me? HDMAMMF?"
                },
                {
                    "id": "584",
                    "question": "How do I feel attending church together? HDIFTYT?"
                },
                {
                    "id": "585",
                    "question": "What can I do to help you experience more of God's Love? DYFID."
                },
                {
                    "id": "586",
                    "question": "In what way has God worked in my life today? HDMAMMF?"
                },
                {
                    "id": "587",
                    "question": "I am one of God's gifts to you. HDIFAT?"
                },
                {
                    "id": "588",
                    "question": "What does the season of Lent mean to me?"
                },
                {
                    "id": "589",
                    "question": "HDIF about renewing myself this Lent?"
                },
                {
                    "id": "590",
                    "question": "What would I like to accomplish this season of Lent?"
                },
                {
                    "id": "591",
                    "question": "How do I recognize Christ in you?"
                },
                {
                    "id": "592",
                    "question": "How can our family gain strength in the Holy Family?"
                },
                {
                    "id": "593",
                    "question": "Are our sacrifices meaningful or just a requirement of Lent?"
                },
                {
                    "id": "594",
                    "question": "HDIF about my spiritual growth during this Lenten season?"
                },
                {
                    "id": "595",
                    "question": "How can I be an inspiration to our family during Lent?"
                },
                {
                    "id": "596",
                    "question": "We are the church seven days a week, not only on Sunday. HDIFAT?"
                },
                {
                    "id": "597",
                    "question": "If Christ dropped in to visit today, would He feel at home?"
                },
                {
                    "id": "598",
                    "question": "How has Lent prepared us for Holy Week?"
                },
                {
                    "id": "599",
                    "question": "Have I ever felt the power of the Holy Spirit?"
                },
                {
                    "id": "600",
                    "question": "What memories of Easter do I cherish most?"
                },
                {
                    "id": "601",
                    "question": "HDIF knowing God planned for us to be together?"
                },
                {
                    "id": "602",
                    "question": "How has our inability to live out God's Plan for our marriage affected us?"
                },
                {
                    "id": "603",
                    "question": "God hears and sees all I do. HDIFAT?"
                },
                {
                    "id": "604",
                    "question": "What are my thoughts when I hear, God does not make junk?"
                },
                {
                    "id": "605",
                    "question": "What activity helps me grow as a Christian?"
                },
                {
                    "id": "606",
                    "question": "If God is for us, who could be against us? HDTMMF?"
                }
            ]
        },
        {
            "id": "14",
            "category": "Group Questions",
            "plan": "1",
            "priority": "14",
            "questions": [
                {
                    "id": "607",
                    "question": "How do I feel about being in our C.O.R.E. or Sharing group? Describe in loving  detail.\" For those who aren't in a C.O.R.E. or Sharing group, How do I feel about joining a group? Describe in loving detail."
                },
                {
                    "id": "608",
                    "question": "Is there anything I did this week that I regret? HDIFAMA?"
                },
                {
                    "id": "609",
                    "question": "What gift do I have that I rarely use? HDIFAMA?"
                },
                {
                    "id": "610",
                    "question": "How do I feel when I've had a very stressful day? What are my feelings sharing  this with you?"
                },
                {
                    "id": "611",
                    "question": "How do I feel this week living in the modern world? How do I feel sharing this  with you?"
                },
                {
                    "id": "612",
                    "question": "What are me feelings knowing that somewhere, there is another weekend going on  right now? How do I feel sharing this with you?"
                },
                {
                    "id": "613",
                    "question": "If I were an animal, what would I be? HDMAMMF?"
                },
                {
                    "id": "614",
                    "question": "How do I feel when we have to work together on a weekend? HDMAMMF?"
                },
                {
                    "id": "615",
                    "question": "If I could change one thing, and only one thing, about the world, what would it  be? HDIFAMA?"
                },
                {
                    "id": "616",
                    "question": "What fears do I have of growing old? HDIF sharing this with you?"
                },
                {
                    "id": "617",
                    "question": "Is Jesus/God in my heart, or just in my mind? HDIFAMA?"
                },
                {
                    "id": "618",
                    "question": "My favorite memory of Christmas is... HDIF sharing this?"
                },
                {
                    "id": "619",
                    "question": "The thing I most fear is... HDIF sharing this?"
                },
                {
                    "id": "620",
                    "question": "Do I consider myself an optimist, pessimist, or realist? HDIF sharing this?"
                },
                {
                    "id": "621",
                    "question": "How do I feel about the coming end of the year and new year?"
                },
                {
                    "id": "622",
                    "question": "How do I feel about today? HDMAMMF?"
                },
                {
                    "id": "623",
                    "question": "How do I feel when I realize I've done something thoughtless and hurt someone?"
                },
                {
                    "id": "624",
                    "question": "What gift do I have that I rarely use? HDIFAMA?"
                },
                {
                    "id": "625",
                    "question": "What topic would I most like to see discussed in our Retrouvaille community?  HDIFAMA?"
                },
                {
                    "id": "626",
                    "question": "What do I see in God that makes me love Him? HDIFAMA?"
                },
                {
                    "id": "627",
                    "question": "In times of trouble, where do I look first for help, my friends or God?  HDIFAMA?"
                },
                {
                    "id": "628",
                    "question": "In times of trouble, where do I look first for comfort, my friends or God?  HDIFAMA?"
                },
                {
                    "id": "629",
                    "question": "What could I do to help myself understand God better? HDIFAMA?"
                },
                {
                    "id": "630",
                    "question": "\" 'We should give God the same place in our hearts that He holds in the  universe.'    Anonymous Where is God's place in my heart? HDIFAMA?"
                },
                {
                    "id": "631",
                    "question": "How do I feel when someone asks me, 'How is your dialogue?' Describe in  detail."
                },
                {
                    "id": "632",
                    "question": "Lately, my biggest disappointment has been... HDIF about this (besides  disappointed)?"
                },
                {
                    "id": "633",
                    "question": "One of my heroes is... Why? HDIFAMA?"
                },
                {
                    "id": "634",
                    "question": "How do I feel when God's Will seems to be in conflict with my needs? Describe  in detail."
                },
                {
                    "id": "635",
                    "question": "I think I am best known for... HDIFAMA?"
                },
                {
                    "id": "636",
                    "question": "'As long as I have love in my heart, I will always have something to give to  others.' HDIFAT?"
                },
                {
                    "id": "637",
                    "question": "What is the motivating force in my life? HDIFAMA?"
                },
                {
                    "id": "638",
                    "question": "How do I think people perceive me? HDIFAMA?"
                },
                {
                    "id": "639",
                    "question": "Lately, have I accepted peoples feelings, merely tolerated them, or rejected  them? HDIFAMA?"
                },
                {
                    "id": "640",
                    "question": "I judge I failed as/at... HDIFAMA?"
                },
                {
                    "id": "641",
                    "question": "How do I feel about the way I spend my spare time? Describe in loving detail."
                },
                {
                    "id": "642",
                    "question": "How do I feel about discussing religion with someone who's views differ from  mine? Describe in loving detail."
                },
                {
                    "id": "643",
                    "question": "\" 'An admission of error is a sign of strength rather than weakness.' Is it easy  or hard for me to admit my mistakes? HDIFAMA?"
                },
                {
                    "id": "644",
                    "question": "What expectation(s) of mine was not met this last week? HDIFAMA?"
                },
                {
                    "id": "645",
                    "question": "'A closed heart can only be opened from the inside.' Is my heart fully open to  God? If not, where do I need to improve? HDIFAMA(s)?"
                },
                {
                    "id": "646",
                    "question": "I enjoy my relationship with people the most when. . . HDIFAMA?"
                },
                {
                    "id": "647",
                    "question": "Am I more likely to take things too lightly, or worry too much? HDIFAMA?"
                },
                {
                    "id": "648",
                    "question": "A time when I/we went the extra mile to help someone out was. . . HDIF  recalling this?"
                },
                {
                    "id": "649",
                    "question": "When I feel sad, angry, frustrated, etc. (pick one, or one of your own) what is  the best thing someone can do for me? HDIFAMA?"
                },
                {
                    "id": "650",
                    "question": "My whole life should be a prayer to God. How well do I live this? HDIFAMA?"
                },
                {
                    "id": "651",
                    "question": "Am I still striving for a deeper more loving relationship with God, or Have I  stopped because I judge I've done enough? HDIFAMA?"
                },
                {
                    "id": "652",
                    "question": "Jesus would have died for me even if I was the only person on earth. HDIF about  this?"
                },
                {
                    "id": "653",
                    "question": "How do I feel about the blessings and gifts God has given me? Describe in  loving detail."
                },
                {
                    "id": "654",
                    "question": "How do I feel about the role God played in my vows? Describe in loving detail."
                },
                {
                    "id": "655",
                    "question": "What strengths do I have because of the mask I wear? HDIFAMA?"
                },
                {
                    "id": "656",
                    "question": "What comments about myself am I most likely to take personally? HDTMMF?"
                },
                {
                    "id": "657",
                    "question": "What expectations do I have of my Retrouvaille involvement? Are they being met?  HDIFAMA?"
                },
                {
                    "id": "658",
                    "question": "What TV shows do I watch most often? What does this tell me about myself?  HDIFAMA?"
                },
                {
                    "id": "659",
                    "question": "What am I most disillusioned with in my life? HDIFAMA?"
                },
                {
                    "id": "660",
                    "question": "How well do I use the talents given to me by God? HDIFAMA?"
                },
                {
                    "id": "661",
                    "question": "Do I think I release my anger and frustration appropriately? HDIFAMA?"
                },
                {
                    "id": "662",
                    "question": "How do I feel about the way our marriage/my ministry influences those around  us? Describe in loving detail."
                },
                {
                    "id": "663",
                    "question": "How important are friendships to the health of my relationship with God?  HDIFAMA?"
                },
                {
                    "id": "664",
                    "question": "In what aspect of my life do I have the least peace? HDIFA this?"
                },
                {
                    "id": "665",
                    "question": "What aspect of my life brings me the most peace? HDIFAMA?"
                },
                {
                    "id": "666",
                    "question": "What does peace mean to me? HDIFAMA?"
                },
                {
                    "id": "667",
                    "question": "How do I feel about the phrase, 'Each day is an opportunity for a fresh  start.'? Describe in detail."
                },
                {
                    "id": "668",
                    "question": "How do I feel when I make a promise to do something, but need to break it  because of something even more important? Describe in loving detail."
                },
                {
                    "id": "669",
                    "question": "How can I be more open to those around me? HDIFAMA?"
                },
                {
                    "id": "670",
                    "question": "When time is short, do I handle the situation well, or do I tend to go into  panic mode? HDIFAMA?"
                },
                {
                    "id": "671",
                    "question": "Where would I like to go on vacation if I could go anywhere in the world?  HDIFAMA?"
                },
                {
                    "id": "672",
                    "question": "If I could live my life over again, I would. . . HDIFAT?"
                },
                {
                    "id": "673",
                    "question": "One thing I missed from my childhood was. . . HDIFAMA?"
                },
                {
                    "id": "674",
                    "question": "Where do I believe God has called me in ministry? HDIFAMA?"
                },
                {
                    "id": "675",
                    "question": "What special gift of myself do I offer to God today? HDIFAMA?"
                },
                {
                    "id": "676",
                    "question": "How are we different from other couples? HDIFAMA?"
                },
                {
                    "id": "677",
                    "question": "I am a better person because of... HDIFAT?"
                },
                {
                    "id": "678",
                    "question": "The person, place, or thing I miss the most is... HDIFAT?"
                },
                {
                    "id": "679",
                    "question": "How do I feel when I see others struggling? Describe in loving detail."
                },
                {
                    "id": "680",
                    "question": "My top priorities in life are... HDIFAMA?"
                },
                {
                    "id": "681",
                    "question": "If I could have one wish, what would it be and why? How do I feel telling you  this?"
                },
                {
                    "id": "682",
                    "question": "What realistic thing can I do this week to make it better than last week?  HDIFAMA?"
                },
                {
                    "id": "683",
                    "question": "Do I like what I am doing, or am I doing what I like? HDIFAMA?"
                },
                {
                    "id": "684",
                    "question": "I judged you were being selfish when... How did I feel about this? Describe in  loving detail."
                },
                {
                    "id": "685",
                    "question": "What about my relationship with God would I like to improve? HDIFAMA?"
                },
                {
                    "id": "686",
                    "question": "What would be the hardest thing for me to give up for a week? Why? HDIFAMA?"
                },
                {
                    "id": "687",
                    "question": "Do I give or take too much from you/others? HDIFAMA?"
                },
                {
                    "id": "688",
                    "question": "In what situation am I most likely to use exaggeration? HDIFAMA?"
                },
                {
                    "id": "689",
                    "question": "What do I see as your strengths? HDIF sharng this with you?"
                },
                {
                    "id": "690",
                    "question": "Do my selfish desires create obstacles in my relationship with God? HDIFAMA?"
                },
                {
                    "id": "691",
                    "question": "Lately, how have I responded to God's call to me? HDIFAMA?"
                },
                {
                    "id": "692",
                    "question": "Do my personal goals conflict with the goals God has for me? HDIFAMA?"
                },
                {
                    "id": "693",
                    "question": "Do I make other things more important than God? What? HDIFAMA?"
                },
                {
                    "id": "694",
                    "question": "God sees me/us as very special because... HDIFAT?"
                },
                {
                    "id": "695",
                    "question": "How do I feel about the current political atmosphere in my/our country? DILD."
                },
                {
                    "id": "696",
                    "question": "How do I feel when someone I don't know well offers me advice? DILD."
                },
                {
                    "id": "697",
                    "question": "HDIF about getting other people's advice for solving our problems?"
                },
                {
                    "id": "698",
                    "question": "What family memories of Spring do I have? HDMAMMF?"
                },
                {
                    "id": "699",
                    "question": "What hinders us from making better decisions? HDIFAT?"
                }
            ]
        },
        {
            "id": "15",
            "category": "Humor",
            "plan": "1",
            "priority": "15",
            "questions": [
                {
                    "id": "700",
                    "question": "What do you do that makes me laugh? HDIFAMA?"
                },
                {
                    "id": "701",
                    "question": "'Life is what happens while we are making other plans.' HDIFAT?"
                },
                {
                    "id": "702",
                    "question": "HDIF when I make you laugh?"
                },
                {
                    "id": "703",
                    "question": "Of the people I know, who do I judge has the best sense of humor? HDTMMF?"
                },
                {
                    "id": "704",
                    "question": "How do I feel when someone tells a joke that makes fun of someone of my  profession, ethnic background, gender, etc.? Describe in loving detail."
                },
                {
                    "id": "705",
                    "question": "How do I react to practical jokes? HDIFAMA?"
                },
                {
                    "id": "706",
                    "question": "How do I feel when someone plays a practical joke on me? Describe in loving  detail."
                },
                {
                    "id": "707",
                    "question": "How do I feel when I hear the sounds of laughter coming from another building?  Describe in loving detail."
                },
                {
                    "id": "708",
                    "question": "What would I like to do in the next month if I knew I had only one month to  live? HDMAMMF?"
                },
                {
                    "id": "709",
                    "question": "What does our relationship need, the most? HDIFTYT?"
                },
                {
                    "id": "710",
                    "question": "How does my self esteem, or lack of it, affect our relationship? HDMAMMF?"
                },
                {
                    "id": "711",
                    "question": "What areas in our marriage are good? HDIFAT?"
                },
                {
                    "id": "712",
                    "question": "What areas in our marriage are poor? HDIFAT?"
                },
                {
                    "id": "713",
                    "question": "What divides us and causes us to become \"married singles\"? HDTMMF?"
                },
                {
                    "id": "714",
                    "question": "Do we accept each other as we are or do we try to remodel each other? HDMAMMF?"
                },
                {
                    "id": "715",
                    "question": "In what ways have I shown my acceptance of you in the past week? How do I think  that has make you feel?"
                },
                {
                    "id": "716",
                    "question": "How have I experienced understanding in our relationship? HDMAMMF?"
                },
                {
                    "id": "717",
                    "question": "What about our relationship would I like to improve? HDIF sharing this with  you?"
                },
                {
                    "id": "718",
                    "question": "How do I feel when someone plays a practical joke on me? DILD."
                }
            ]
        },
        {
            "id": "16",
            "category": "Listening",
            "plan": "1",
            "priority": "16",
            "questions": [
                {
                    "id": "719",
                    "question": "How well do I think I listen to you? HDTMMF?"
                },
                {
                    "id": "720",
                    "question": "Do I listen better to you or to others?\" HDTMMF?"
                },
                {
                    "id": "721",
                    "question": "What kind of listener was I before our Retrouvaille weekend? HDMAMMF?"
                },
                {
                    "id": "722",
                    "question": "In what ways does my mask interfere with how I listen to you? HDMAMMF?"
                },
                {
                    "id": "723",
                    "question": "What was a time during our dialogue that I felt that you were really listening  to me?\" HDMAMMF?"
                },
                {
                    "id": "724",
                    "question": "What listening skills could improve our relationship? HDIFTYT?"
                }
            ]
        },
        {
            "id": "17",
            "category": "Love",
            "plan": "1",
            "priority": "17",
            "questions": [
                {
                    "id": "725",
                    "question": "What was my biggest challenge in loving you today? HDIF sharing this with you?"
                },
                {
                    "id": "726",
                    "question": "What did I do today to generate a little more love in the world? HDIFAMA?"
                },
                {
                    "id": "727",
                    "question": "What do I see in you that makes me love you? HDIFAMA?"
                },
                {
                    "id": "728",
                    "question": "What do I think about my ability to accept your loving me? HDIFAMA?"
                },
                {
                    "id": "729",
                    "question": "This is how you have helped me know love, and donate/give myself (to others).  HDTMMF?"
                },
                {
                    "id": "730",
                    "question": "What would I say most represents a symbol of our loving relationship? HDIFAMA?"
                },
                {
                    "id": "731",
                    "question": "It is possible to give without loving, but it is impossible to love without  giving.'  R. Braunstein HDIFAT?"
                },
                {
                    "id": "732",
                    "question": "When was the last time I left you a love note? HDMAMMF?"
                },
                {
                    "id": "733",
                    "question": "Our love for each other is a reflection of God's love for us. HDTMMF?"
                },
                {
                    "id": "734",
                    "question": "What do I love most about you today? HDTMMF?"
                },
                {
                    "id": "735",
                    "question": "Jesus is counting on us to make His love believable. HDTMMF?"
                },
                {
                    "id": "736",
                    "question": "HDIF when you show me that you love me?"
                },
                {
                    "id": "737",
                    "question": "What do I think and feel when I hear the statment: 'Love isn't love until you  give it away?'"
                },
                {
                    "id": "738",
                    "question": "Do I love you more for you, or for God? (Do I think my love for you is more for  you, or for God) HDIFAMA?"
                },
                {
                    "id": "739",
                    "question": "'As long as I have love in my heart, I will always have something  to give to others.' HDIFAT?"
                },
                {
                    "id": "740",
                    "question": "Do I think our love makes/has made a difference in the neighborhood, community,  state, nation, world (pick one)? HDIFAMA?"
                },
                {
                    "id": "741",
                    "question": "What do my answers tell me about myself? HDIFAT?"
                },
                {
                    "id": "742",
                    "question": "How well do I think I show my love to you? HDIF sharing this with you?"
                },
                {
                    "id": "743",
                    "question": "I most need you to love me when... HDIFAT?"
                },
                {
                    "id": "744",
                    "question": "The song that I think represents our love the best is... Why? HDIF sharing this  with you?"
                },
                {
                    "id": "745",
                    "question": "What do I see in you that makes me love you? HDIFAMA?"
                },
                {
                    "id": "746",
                    "question": "What did I do today to generate a little more love in the world? HDIFAMA?"
                },
                {
                    "id": "747",
                    "question": "What can I do tommorrow to generate a little more love in the world? HDFIFAMA?"
                },
                {
                    "id": "748",
                    "question": "Do I put conditions on my love for you? HDIFAMA?"
                },
                {
                    "id": "749",
                    "question": "Our Love is a journey, not a destination. HDIFAT?"
                },
                {
                    "id": "750",
                    "question": "How has my love for you changed since our dating days, wedding, or weekend  (pick one)? Hdif sharing this with you?"
                },
                {
                    "id": "751",
                    "question": "What barrier do I have the hardest time overcoming in order to love you? HDIF  sharing this with you?"
                },
                {
                    "id": "752",
                    "question": "How do I show my love for you? HDMAMMF?"
                },
                {
                    "id": "753",
                    "question": "How have I experienced love in our relationship? HDMAMMF?"
                },
                {
                    "id": "754",
                    "question": "\" 'We can do no great things, only small things with great love.'   Mother  Teresa. How does this make me feel?"
                },
                {
                    "id": "755",
                    "question": "What conditions do I put on my love for you? HDIF sharing this with you?"
                },
                {
                    "id": "756",
                    "question": "In what way am I trying to love you the way God loves us? HDIF sharing this  with you?"
                },
                {
                    "id": "757",
                    "question": "We have committed ourselves to loving each other for a lifetime. HDIFAT?"
                },
                {
                    "id": "758",
                    "question": "HDIF holding hands during church?"
                },
                {
                    "id": "759",
                    "question": "In what ways do I affirm my love for you? HDIFAT?"
                },
                {
                    "id": "760",
                    "question": "Our Lord calls us to love one another unconditionally. HDIFAT? HDMAMMF?"
                },
                {
                    "id": "761",
                    "question": "What can I do to show you more love? HDIFAT?"
                },
                {
                    "id": "762",
                    "question": "HDIF when I listen patiently to your heartaches?"
                }
            ]
        },
        {
            "id": "18",
            "category": "Marriage",
            "plan": "1",
            "priority": "18",
            "questions": [
                {
                    "id": "763",
                    "question": "How do I feel about us today? Describe in loving detail."
                },
                {
                    "id": "764",
                    "question": "What do I do that I think helps bring us closer together? HDIFAMA?"
                },
                {
                    "id": "765",
                    "question": "What do I control that I should give up to help improve our relationship?  HDIFAT?"
                },
                {
                    "id": "766",
                    "question": "God's greatest treasure is you.\" HDIFAT?"
                },
                {
                    "id": "767",
                    "question": "How do I feel when there is no time in the day (week) for us? Describe in  loving detail."
                },
                {
                    "id": "768",
                    "question": "If I could go back and record any moment from our past so we could watch it  from time to time, what would it be and why? How do I feel remembering this? How  do I feel about it now?"
                },
                {
                    "id": "769",
                    "question": "What little annoyance(s) have I tried to accept but haven't been able to, yet I  haven't talked to you about? HDIFAT?"
                },
                {
                    "id": "770",
                    "question": "Are there any hurts between us that need to be healed of before our  relationship can continue to grow? HDIFAMA?"
                },
                {
                    "id": "771",
                    "question": "How do I feel when you are frustrated or angry with someone or something else,  but you take that frustration or anger out on me? Describe in loving detail."
                },
                {
                    "id": "772",
                    "question": "How do I feel when you change your mind after we've agreed on something, or  made a decision on something? Describe in loving detail."
                },
                {
                    "id": "773",
                    "question": "How do I feel when I see you cry after watching a movie together? Describe in  loving detail."
                },
                {
                    "id": "774",
                    "question": "How do I feel when we have to work together on a project? Describe in loving  detail."
                },
                {
                    "id": "775",
                    "question": "How have we grown as a couple over the last year? HDIFAMA?"
                },
                {
                    "id": "776",
                    "question": "How do I feel when I realize I've done something thoughtless and hurt you?  Describe in loving detail."
                },
                {
                    "id": "777",
                    "question": "What could I do to help you understand me better? HDIFAMA?"
                },
                {
                    "id": "778",
                    "question": "What is my favorite memory of us from last year? HDIF sharing this with you?"
                },
                {
                    "id": "779",
                    "question": "With what aspect of our relationship am I most comfortable? HDIF sharing this  with you?"
                },
                {
                    "id": "780",
                    "question": "What are my most important values for our relationship? HDIFAMA?"
                },
                {
                    "id": "781",
                    "question": "What keeps us together as a couple? HDTMMF?"
                },
                {
                    "id": "782",
                    "question": "What would I say most represents a symbol of our loving relationship? HDIFAMA?"
                },
                {
                    "id": "783",
                    "question": "Do we share the responsibility for making decisions? Explain. HDIFAMA?"
                },
                {
                    "id": "784",
                    "question": "What non verbal expression, gesture, or behavior of yours do I most often rely  on to help me understand how you feel? HDIF sharing this with you now?"
                },
                {
                    "id": "785",
                    "question": "Do we have things I consider to be only mine? HDTMMF?"
                },
                {
                    "id": "786",
                    "question": "Am I satisfied with our relationship? If so, should I be? If not, why?  HDIFAMA?"
                },
                {
                    "id": "787",
                    "question": "How and when did I appreciate your beauty this week? HDIF sharing this with you  now?"
                },
                {
                    "id": "788",
                    "question": "How did our relationship reflect God's love today? HDIFAMA?"
                },
                {
                    "id": "789",
                    "question": "In what areas am I least responsive to you? HDIFAMA?"
                },
                {
                    "id": "790",
                    "question": "It is easier to leave angry words unspoken, than to mend a heart those words  have broken.'    unknown author Lately, have I said any words that were angry  and may have hurt you? HDIFAMA?"
                },
                {
                    "id": "791",
                    "question": "How does our schedule affect our relationship? HDMAMMF?"
                },
                {
                    "id": "792",
                    "question": "How much of a couple do I really want to be, and what am I willing to change to  be that couple? HDMAMMF?"
                },
                {
                    "id": "793",
                    "question": "What is the best way you support me in our relationship? HDTMMF?"
                },
                {
                    "id": "794",
                    "question": "What is my most sacred memory of our wedding day? HDTMMF?"
                },
                {
                    "id": "795",
                    "question": "Do I see death as an end to our love relationship? HDTMMF?"
                },
                {
                    "id": "796",
                    "question": "How do I still let my mask prevent me from putting you number one? HDTMMF?"
                },
                {
                    "id": "797",
                    "question": "What changes do I have to make to make you number one? HDIFAT?"
                },
                {
                    "id": "798",
                    "question": "What is our best quality as a couple? HDIFAT?"
                },
                {
                    "id": "799",
                    "question": "HDIF knowing that we will always have to work for real closeness in our  relationship?"
                },
                {
                    "id": "800",
                    "question": "HDIF when you make a sacrifice for me?"
                },
                {
                    "id": "801",
                    "question": "HDIF about the direction our life together is taking?"
                },
                {
                    "id": "802",
                    "question": "When do I feel closest to you? HDIFAMA?"
                },
                {
                    "id": "803",
                    "question": "Do I believe you when you reveal my goodness? HDMAMMF?"
                },
                {
                    "id": "804",
                    "question": "In what area do I most need your help in living as a sacramental couple? HDIF  sharing this with you?"
                },
                {
                    "id": "805",
                    "question": "What advise would I give a young bride or groom (pick one)? How do I feel about  this?"
                },
                {
                    "id": "806",
                    "question": "Why did I marry you? Why do I stay married to you? HDIFAMA?"
                },
                {
                    "id": "807",
                    "question": "How do I feel about the way our marriage influences those around us? Describe  in loving detail."
                },
                {
                    "id": "808",
                    "question": "What do I find most attractive about you? HDIF sharing this with you?"
                },
                {
                    "id": "809",
                    "question": "What stage of love do I think we are in (Romance, Disillusion, Misery, Joy)?  HDIFAMA?"
                },
                {
                    "id": "810",
                    "question": "How do I feel about marrying you every day? Describe in loving detail."
                },
                {
                    "id": "811",
                    "question": "What is my typical behavior when dealing with a hard time in our relationship?  HDIFAMA?"
                },
                {
                    "id": "812",
                    "question": "What is most appealing to me about being married? HDIFAMA?"
                },
                {
                    "id": "813",
                    "question": "In general, do I give you more criticism or praise? HDIFAMA?"
                },
                {
                    "id": "814",
                    "question": "Are we still striving for a deeper loving marriage, or have we stopped because  we judge we've done enough? HDIFAMA?"
                },
                {
                    "id": "815",
                    "question": "When I feel sad, angry, frustrated, etc. (pick one, or one of your own) what is  the best thing you can do for me? HDIFAMA?"
                },
                {
                    "id": "816",
                    "question": "What power do I hold over you that may be a barrier to our relationship?  HDIFAMA?"
                },
                {
                    "id": "817",
                    "question": "How do I feel about our marriage as a sign of love to others? Describe in  loving detail."
                },
                {
                    "id": "818",
                    "question": "What have I given up for our relationship that has helped me grow as a person?  HDIF about this?"
                },
                {
                    "id": "819",
                    "question": "What have I given up for our relationship that has held me back in my  development as a person? HDIF about this?"
                },
                {
                    "id": "820",
                    "question": "What have I given up for my calling that has held me back in my development as  a person? HDIF about this?"
                },
                {
                    "id": "821",
                    "question": "What helps me learn the most about you? (i.e. dialoguing, making love, sharing  our days, quiet time together, etc.) HDIF sharing this with you?"
                },
                {
                    "id": "822",
                    "question": "With what aspect of our relationship am I most comfortable? HDIF sharing this  with you?"
                },
                {
                    "id": "823",
                    "question": "What could I do to help you understand me better? HDIFAMA?"
                },
                {
                    "id": "824",
                    "question": "How do I feel about the time we spend together and the quality of it? What  would I like to change if I could? HDMAMMF?"
                },
                {
                    "id": "825",
                    "question": "How do I feel when you are frustrated or angry with someone or something else,  but you take that frustration or anger out on me? Describe in loving detail."
                },
                {
                    "id": "826",
                    "question": "What is my favorite memory of us as a couple? (without children, just you and  your spouse) How do I feel thinking about this? HDIF sharing this with you?"
                },
                {
                    "id": "827",
                    "question": "On a scale of 1 10, where would I like our relationship to be? On the same 1 10  scale, where is our relationship now? HDIF about this? What can I do in the next  week to bring our relationship closer to a 10?"
                },
                {
                    "id": "828",
                    "question": "What feelings do I have when I think about us being apart for several days?  HDIF sharing this with you?"
                },
                {
                    "id": "829",
                    "question": "What challenges did I face today in making you the center of my life? How do I  feel about this? HDIF sharing this with you?"
                },
                {
                    "id": "830",
                    "question": "When did I realize that I wanted to spend the rest of my life with you? How do  I feel recalling this? What are my feelings sharing this with you?"
                },
                {
                    "id": "831",
                    "question": "Are we as close to each other as we were just after our Retrouvaille weekend?  HDIFAMA?"
                },
                {
                    "id": "832",
                    "question": "What one thing do you do that helps bring me closest to you? HDIF sharing this  with you?"
                },
                {
                    "id": "833",
                    "question": "How do I feel about spending the rest of my life with you?"
                },
                {
                    "id": "834",
                    "question": "Are we as close today as we used to be? HDIFAMA?"
                },
                {
                    "id": "835",
                    "question": "When was I most aware of you today? HDIFAMA?"
                },
                {
                    "id": "836",
                    "question": "How can I be more aware of the unique goodness and worth of my spouse?\"  HDMAMMF?"
                },
                {
                    "id": "837",
                    "question": "How can I delight in my spouse's goodness without trying to possess him/her?  HDMAMMF?"
                },
                {
                    "id": "838",
                    "question": "What is one of the greatest moments of our marriage? HDIF sharing this with  you?"
                },
                {
                    "id": "839",
                    "question": "What do I seek in our relationship? HDIF sharing this with you?"
                },
                {
                    "id": "840",
                    "question": "Where do I feel most alone in our relationship? How have I communicated this  with you? HDMAMMF?"
                },
                {
                    "id": "841",
                    "question": "Why do I want to make you number one in my life? What stands in my way? HDIF  sharing this with you?"
                },
                {
                    "id": "842",
                    "question": "In what area of my life am I living as a married single? HDTMMF?"
                },
                {
                    "id": "843",
                    "question": "How do I feel about our relationship today compared to before our weekend? HDIF  sharing this with you?"
                },
                {
                    "id": "844",
                    "question": "What kind of a 'sign' do I think we have been to others this week? HDTMMF?"
                },
                {
                    "id": "845",
                    "question": "How do I feel about us being important to the church and the world? HDIF  sharing this with you?"
                },
                {
                    "id": "846",
                    "question": "Do I compare our relationship to those around us? HDIFAMA?"
                },
                {
                    "id": "847",
                    "question": "Are we equal partners in our decision making? HDIFAMA?"
                },
                {
                    "id": "848",
                    "question": "Our marriage is a sign of Christ's Love. How do I think others experienced our  sign today? HDTMMF?"
                },
                {
                    "id": "849",
                    "question": "What is my fondest memory of our wedding day? HDIFAT?"
                },
                {
                    "id": "850",
                    "question": "What is my reaction to seeing couples we know and love working on their  relationships? HDIFAT?"
                },
                {
                    "id": "851",
                    "question": "In the last week, in what way have I been most supported by you? HDTMMF?"
                },
                {
                    "id": "852",
                    "question": "How have we shared our relationship with other people in our community, parish,  and neighborhood this week? HDIFAT?"
                },
                {
                    "id": "853",
                    "question": "What talents do we have as a couple? HDIFAMA?"
                },
                {
                    "id": "854",
                    "question": "What do I perceive to be the biggest threat to our relationship? HDIFSTWY?"
                },
                {
                    "id": "855",
                    "question": "Why did I marry you? HDIF sharing this with you now?"
                },
                {
                    "id": "856",
                    "question": "How do I fel about the way our marriage influences other people? DILD."
                },
                {
                    "id": "857",
                    "question": "How do I feel when we look at pictures from our wedding? DILD."
                },
                {
                    "id": "858",
                    "question": "On a scale of 1 10, I would rate the health of our marriage a... HDIFSTWY?"
                },
                {
                    "id": "859",
                    "question": "What one thing has most united us this past week? HDIFAT?"
                },
                {
                    "id": "860",
                    "question": "During an average week, what activities enhance our relationship?"
                },
                {
                    "id": "861",
                    "question": "What do I enjoy about our relationship right now? HDMAMMF?"
                },
                {
                    "id": "862",
                    "question": "We had hopes for each other on our wedding day. HDIFAT now?"
                },
                {
                    "id": "863",
                    "question": "In what ways are you still a mystery to me? HDIFAT?"
                },
                {
                    "id": "864",
                    "question": "Do we still court each other? HDIFAT?"
                },
                {
                    "id": "865",
                    "question": "WAMF when I think about us 10 years from now?"
                },
                {
                    "id": "866",
                    "question": "Have we grown or slipped backward in our relationship this week? HDIFAT?"
                },
                {
                    "id": "867",
                    "question": "In an average week, what activities work against our relationship?"
                },
                {
                    "id": "868",
                    "question": "Am I doing better accepting you as you are? DYFILD."
                },
                {
                    "id": "869",
                    "question": "In what way do I try to modify my behavior to please you? HDIFAT?"
                },
                {
                    "id": "870",
                    "question": "How can we put more fireworks into our marriage?"
                },
                {
                    "id": "871",
                    "question": "HDIF when I know someone is cheating on their wife/husband?"
                },
                {
                    "id": "872",
                    "question": "HDIF when we appear as partners and not as individuals?"
                }
            ]
        },
        {
            "id": "19",
            "category": "Ministry",
            "plan": "1",
            "priority": "19",
            "questions": [
                {
                    "id": "873",
                    "question": "How do I feel about being missionary a for God? Describe in loving detail."
                },
                {
                    "id": "874",
                    "question": "How do I feel about our involvement with our church and the activities there?  Describe in loving detail."
                },
                {
                    "id": "875",
                    "question": "What do I most like about Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "876",
                    "question": "What do I least like about Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "877",
                    "question": "What topic would I most like to see discussed on Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "878",
                    "question": "Full grown oaks are not produced in three years; neither are servants of God.'    Douglas Rumford How do I feel about my service to God? (Am I impatient,  dissatisfied, ambivalent, etc.) Describe in loving detail."
                },
                {
                    "id": "879",
                    "question": "Where do I believe God has called us in ministry as a couple? HDIFAMA?"
                },
                {
                    "id": "880",
                    "question": "How do I feel when I have to do most of the work for a ministry project?  Describe in loving detail."
                },
                {
                    "id": "881",
                    "question": "What quality of mine keeps me from being more involved in our  church/parish/synagogue/etc.? HDIFAMA?"
                },
                {
                    "id": "882",
                    "question": "In what area of Retrouvaille am I interested in investing our time, talents,  support, and love in? HDMAMMF?"
                },
                {
                    "id": "883",
                    "question": "How do I feel about giving our time to helping others? Describe in loving  detail."
                },
                {
                    "id": "884",
                    "question": "HDIF about our involvement in the church?"
                }
            ]
        },
        {
            "id": "20",
            "category": "Money",
            "plan": "1",
            "priority": "20",
            "questions": [
                {
                    "id": "885",
                    "question": "How do I think our finances affect our relationship? HDIFAMA?"
                },
                {
                    "id": "886",
                    "question": "How do I feel about our current financial situation? Describe in loving  detail."
                },
                {
                    "id": "887",
                    "question": "What are my feelings about the way we are managing our finances? Describe in  loving detail."
                },
                {
                    "id": "888",
                    "question": "How do I feel about the way we balance the check book? Describe in loving  detail."
                },
                {
                    "id": "889",
                    "question": "How does our financial situation affect our unity? How does it affect our  intimacy? HDIFA my answers?"
                },
                {
                    "id": "890",
                    "question": "If we doubled our present income, would we be any happier? HDMAMMF?"
                },
                {
                    "id": "891",
                    "question": "HDIF about the way I/you/we handle money?"
                },
                {
                    "id": "892",
                    "question": "HDIF when I think about our financial position?"
                },
                {
                    "id": "893",
                    "question": "What do I think I most need to change about the way I use money? HDIFAMA?"
                },
                {
                    "id": "894",
                    "question": "How do I feel about making a monetary sacrifice so that others can attend a  weekend? Describe in loving detail."
                },
                {
                    "id": "895",
                    "question": "How would I feel if we won the Lottery? HDMAMMF?"
                },
                {
                    "id": "896",
                    "question": "How do I feel about our current financial situation? HDIF telling you this?"
                },
                {
                    "id": "897",
                    "question": "Why do I want to dialogue in the area of possessions? HDIFAT?"
                },
                {
                    "id": "898",
                    "question": "What do I hope to gain in the area of possessions? HDIFAT?"
                },
                {
                    "id": "899",
                    "question": "What do I like best about you in the area of possessions? HDIFAT?"
                },
                {
                    "id": "900",
                    "question": "What do I like least about you in the area of possessions? HDIFAT?"
                },
                {
                    "id": "901",
                    "question": "What do I like best about myself in the area of possessions? HDIFAT?"
                },
                {
                    "id": "902",
                    "question": "What do I like least about myself in the area of possessions? HDIFAT?"
                },
                {
                    "id": "903",
                    "question": "What do I like best about us in the area of possessions? HDIFAT?"
                },
                {
                    "id": "904",
                    "question": "What mask do I wear in the area of possessions? HDIFAT?"
                },
                {
                    "id": "905",
                    "question": "When am I least open to listen to you in the area of possessions? HDIFAT?"
                },
                {
                    "id": "906",
                    "question": "In the area of possessions what feeling do I find most difficult to share with  you? Describe feelings in loving detail."
                },
                {
                    "id": "907",
                    "question": "Why do I want to dialogue in the area of money? HDIFAT?"
                },
                {
                    "id": "908",
                    "question": "What do I hope to gain in the area of money? HDIFAT?"
                },
                {
                    "id": "909",
                    "question": "What do I like best about you in the area of money? HDIFAT?"
                },
                {
                    "id": "910",
                    "question": "What do I like least about you in the area of money? HDIFAT?"
                },
                {
                    "id": "911",
                    "question": "What do I like best about myself in the area of money? HDIFAT?"
                },
                {
                    "id": "912",
                    "question": "What do I like least about myself in the area of money? HDIFAT?"
                },
                {
                    "id": "913",
                    "question": "What do I like best about us in the area of money? HDIFAT?"
                },
                {
                    "id": "914",
                    "question": "What mask do I wear in the area of money? HDIFAT?"
                },
                {
                    "id": "915",
                    "question": "When am I least open to listen to you in the area of money? HDIFAT?"
                },
                {
                    "id": "916",
                    "question": "In the area of money what feeling do I find most difficult to share with you?  Describe feelings in loving detail."
                },
                {
                    "id": "917",
                    "question": "How do I feel about our financial situation? Describe in loving detail."
                },
                {
                    "id": "918",
                    "question": "How do I feel about donating money to the poor? Describe in loving detail."
                },
                {
                    "id": "919",
                    "question": "How do I feel when we need to take out a lone for a major purchase? Describe in  loving detail."
                },
                {
                    "id": "920",
                    "question": "How do I feel about letting someone outside my/our family borrow my/our car?  Describe in loving detail."
                },
                {
                    "id": "921",
                    "question": "In thinking about our finances, what is my strongest feeling? HDIF sharing this  with you?"
                },
                {
                    "id": "922",
                    "question": "HDIF about our financial pressures this time of year?"
                },
                {
                    "id": "923",
                    "question": "How important is financial security to me?"
                },
                {
                    "id": "924",
                    "question": "How important are material things to me?"
                },
                {
                    "id": "925",
                    "question": "Do we ever let material things interfere with our relationship? HDMAMMF?"
                },
                {
                    "id": "926",
                    "question": "How do I see our finances affecting our relationship?"
                },
                {
                    "id": "927",
                    "question": "HDIF about making big financial decisions without you?"
                },
                {
                    "id": "928",
                    "question": "HDIF when we would like to do something but can afford it?"
                },
                {
                    "id": "929",
                    "question": "Have we shared our material blessings with others? HDMAMMF?"
                },
                {
                    "id": "930",
                    "question": "What blocks me from talking about money with you?"
                }
            ]
        },
        {
            "id": "21",
            "category": "Needs",
            "plan": "1",
            "priority": "21",
            "questions": [
                {
                    "id": "931",
                    "question": "How well do I think I do at recognizing and trying to nourish my needs as  opposed to my selfish wants? HDIFAMA?"
                },
                {
                    "id": "932",
                    "question": "What need of mine am I most aware of as needing to be nourished? HDIFAMA?"
                },
                {
                    "id": "933",
                    "question": "Do I think we spend enough time together, or is the time we spend together  quality time? HDIFAMA?"
                },
                {
                    "id": "934",
                    "question": "What barriers keep me from sharing with you my unnourished needs? HDIFAMA?"
                },
                {
                    "id": "935",
                    "question": "How do we show our respect for each other in front of others? HDIFAMA?"
                },
                {
                    "id": "936",
                    "question": "How do I feel when we are both tired, but still have a lot to do before we can  go to bed? Describe in loving detail."
                },
                {
                    "id": "937",
                    "question": "Besides my relationship with you, what other relationships do I seek out to  nourish my needs? HDIF sharing this with you?"
                },
                {
                    "id": "938",
                    "question": "How do I feel when your needs seem to be in conflict with mine? Describe in  loving detail."
                },
                {
                    "id": "939",
                    "question": "Where do I look for help when I find I am in over my head? HDIFAMA?"
                },
                {
                    "id": "940",
                    "question": "What do I most depend upon you for? HDIF sharing this with you?"
                },
                {
                    "id": "941",
                    "question": "HDIF knowing that I cannot fill your needs for you?"
                },
                {
                    "id": "942",
                    "question": "Am I sometimes guilty of empty or insincere affirmation? HDIFAMA?"
                },
                {
                    "id": "943",
                    "question": "Do material possessions mean as much to me as they did before our weekend?  HDMAMMF?"
                },
                {
                    "id": "944",
                    "question": "How does my self image affect my view of us? HDMAMMF?"
                },
                {
                    "id": "945",
                    "question": "Where am I most selfish? HDTMMF?"
                },
                {
                    "id": "946",
                    "question": "Right now, what need of mine (Love, Belonging, Self worth, or Autonomy) is in  most need of nourishment? HDIFAMA?"
                },
                {
                    "id": "947",
                    "question": "What present would I give you today, if I could give you anything? HDTMMF?"
                },
                {
                    "id": "948",
                    "question": "How do I feel about spending the rest of my life with you?"
                },
                {
                    "id": "949",
                    "question": "What are my feelings about keeping the Dream alive?"
                },
                {
                    "id": "950",
                    "question": "How do I act when my need for autonomy, self worth, love, or belonging (agree  on one) is not being met? HDIFAMA?"
                },
                {
                    "id": "951",
                    "question": "In times of trouble, where do I look first for help, you or God? HDIFAMA?"
                },
                {
                    "id": "952",
                    "question": "In times of trouble, where do I look first for solace, you or God? HDIFAMA?"
                },
                {
                    "id": "953",
                    "question": "In times of trouble, where do I look first for comfort, you or God? HDIFAMA?"
                },
                {
                    "id": "954",
                    "question": "What do I most depend upon you for? HDIF sharing this with you?"
                },
                {
                    "id": "955",
                    "question": "What do I most want for our family this New Year? HDIF sharing this with you?"
                },
                {
                    "id": "956",
                    "question": "Besides my relationship with you, what other relationships do I seek out to  nourish my needs? HDIF sharing this with you?"
                },
                {
                    "id": "957",
                    "question": "Do I take credit for other's work? Do I give credit where credit is due?  HDIFAMA?"
                },
                {
                    "id": "958",
                    "question": "How do I feel when we are both tired, but still have a lot to do before we can  go to bed? Describe in loving detail."
                },
                {
                    "id": "959",
                    "question": "When have I experienced your acceptance of me this week? What are my feelings  about this?"
                },
                {
                    "id": "960",
                    "question": "Am I more concerned with my outer or inner appearance? HDIFAMA?"
                },
                {
                    "id": "961",
                    "question": "Do I judge I have enough freedom? HDIFAMA?"
                },
                {
                    "id": "962",
                    "question": "How am I presently recognizing (affirming) my husband/wife? HDMAMMF?"
                },
                {
                    "id": "963",
                    "question": "How would I like to be affirmed and recognized by my husband/wife? HDIFAMA?"
                },
                {
                    "id": "964",
                    "question": "What do I do when my need for love, belonging, self worth, or autonomy (pick  one) are not being nourished? HDIFAMA?"
                },
                {
                    "id": "965",
                    "question": "What I need most from you tonight is . . .. HDMAMMF?"
                },
                {
                    "id": "966",
                    "question": "What I need most to offer you to most tonight is . . .. HDMAMMF?"
                },
                {
                    "id": "967",
                    "question": "How do I feel about the phrase: 'My/Our needs are not problems, but gifts from  God?' Describe in loving detail."
                },
                {
                    "id": "968",
                    "question": "How accepting of others have I been this week? HDMAMMF?"
                },
                {
                    "id": "969",
                    "question": "When recently have I put your needs ahead of mine? HDTMMF?"
                },
                {
                    "id": "970",
                    "question": "How do I feel about us being needed by others?"
                },
                {
                    "id": "971",
                    "question": "Since we have attended the Retrouvaille program, what need of mine have I  identified through my sharing my feelings in Dialogue? HDMAMMF?"
                },
                {
                    "id": "972",
                    "question": "What do I most need from you today? HDIFAMA?"
                },
                {
                    "id": "973",
                    "question": "In what ways do I try to change myself to please you? HDIFAMA?"
                },
                {
                    "id": "974",
                    "question": "What do I want from this relationship right now? DYFID"
                },
                {
                    "id": "975",
                    "question": "When you make me feel wanted, I feel _________."
                },
                {
                    "id": "976",
                    "question": "HDIF making a list of what I need to get done this weekend?"
                },
                {
                    "id": "977",
                    "question": "HDIF when you recognize my needs? HDIFTYT?"
                },
                {
                    "id": "978",
                    "question": "HDIF when you have done something to make me happy?"
                },
                {
                    "id": "979",
                    "question": "What have I done to make you happy this week? HDMAMMF?"
                },
                {
                    "id": "980",
                    "question": "I need support from you in the following areas. HDIFTYT?"
                }
            ]
        },
        {
            "id": "22",
            "category": "Openness",
            "plan": "1",
            "priority": "22",
            "questions": [
                {
                    "id": "981",
                    "question": "What thing or activity would it be difficult for me to give up and why?  HDIFAMA?"
                },
                {
                    "id": "982",
                    "question": "What is the side of me that I least like you to see? Describe it. HDIF sharing  this with you now?"
                },
                {
                    "id": "983",
                    "question": "What quality of yours helps me to decide to be totally honest with you?  HDIFAT?"
                },
                {
                    "id": "984",
                    "question": "How can I be more open to those around me? HDIFAMA?"
                },
                {
                    "id": "985",
                    "question": "If I could be anyone from history, who would I be and why? HDIFSTWY?\" How do I  feel sharing this with you?"
                },
                {
                    "id": "986",
                    "question": "Where would I like to go on vacation if I could go anywhere in the world?  HDIFAMA?"
                },
                {
                    "id": "987",
                    "question": "What is my favorite room of the house and why? HDMAMMF?"
                },
                {
                    "id": "988",
                    "question": "What would you do if you had a magic wand that could grant any wish? HDIFAMA?"
                },
                {
                    "id": "989",
                    "question": "If I were asked to draw a picture of something representing my spouse, what  would I draw? HDIFAMA?"
                },
                {
                    "id": "990",
                    "question": "My greatest goal in life is... HDIFA my progress?"
                },
                {
                    "id": "991",
                    "question": "The most interesting thing you've taught me is . . .. HDMAMMF?"
                },
                {
                    "id": "992",
                    "question": "What advise would I give a young bride or groom (pick one)? HDIFAMA?"
                },
                {
                    "id": "993",
                    "question": "If I could live my life over again, I would... HDIFAMA?"
                },
                {
                    "id": "994",
                    "question": "In what area do I most need your help in living my sacrament/calling? HDIFAMA?"
                },
                {
                    "id": "995",
                    "question": "How do I feel when I think about the couples and religious that will be making  the next weekend?"
                },
                {
                    "id": "996",
                    "question": "How do I think we got together? Accident, Fate or God? HDIFAMA?"
                },
                {
                    "id": "997",
                    "question": "When was a time recently when I tried to know you better? HDMAMMF?"
                },
                {
                    "id": "998",
                    "question": "How do I feel about putting more fireworks into our life? HDIF sharing this  with you?"
                },
                {
                    "id": "999",
                    "question": "When I am open to you, am I also open to God? HDMAMMF?"
                },
                {
                    "id": "1000",
                    "question": "What promises did I make to you on our weekend? How well have I kept those  promises? HDMAMMF?"
                },
                {
                    "id": "1001",
                    "question": "Do I find other women/men attractive? HDIFSTWY?"
                },
                {
                    "id": "1002",
                    "question": "When do I feel least recognized as a capable person?"
                },
                {
                    "id": "1003",
                    "question": "How have I changed recently?"
                },
                {
                    "id": "1004",
                    "question": "What strengths do we have to offer each other as a couple?"
                },
                {
                    "id": "1005",
                    "question": "What strengths do we have to offer others as a couple?"
                },
                {
                    "id": "1006",
                    "question": "In what ways am I still wrapped in a cocoon? HDIFAT?"
                },
                {
                    "id": "1007",
                    "question": "What changes would I like to make in response to my failures? HDIFTYT?"
                },
                {
                    "id": "1008",
                    "question": "What are the negative effects my mask has on me? HDMAMMF?"
                },
                {
                    "id": "1009",
                    "question": "What do I find most difficult to talk about because of my mask? HDIFTYT?"
                },
                {
                    "id": "1010",
                    "question": "What mask am I wearing today? HDMAMMF?"
                },
                {
                    "id": "1011",
                    "question": "If I could change one thing about myself, I would change ________. HDIFTYT?"
                },
                {
                    "id": "1012",
                    "question": "Why do I want to be fulfilled by you? DYFILD."
                },
                {
                    "id": "1013",
                    "question": "Do I sometimes control you instead of accepting you the way you are? HDIFTYT?"
                },
                {
                    "id": "1014",
                    "question": "What keeps me from showing you what you really mean to me?"
                },
                {
                    "id": "1015",
                    "question": "Can I identify with hurting couples? DYFID."
                }
            ]
        },
        {
            "id": "23",
            "category": "Pot Luck",
            "plan": "1",
            "priority": "23",
            "questions": [
                {
                    "id": "1016",
                    "question": "Do we physically touch enough? HDIFAMA?"
                },
                {
                    "id": "1017",
                    "question": "Have we changed enough since our weekend, that others have noticed the  difference, too? HDIFAMA?"
                },
                {
                    "id": "1018",
                    "question": "What area(s) of our relationship do I most often control? HDIFAMA?"
                },
                {
                    "id": "1019",
                    "question": "If I were a musical instrument, which one would I be and why? HDMAMMF?"
                },
                {
                    "id": "1020",
                    "question": "What do I have responsibility for that I would like to give up? HDIF sharing  this with you?"
                },
                {
                    "id": "1021",
                    "question": "What is my favorite city, and why? HDIF sharing this with you?"
                },
                {
                    "id": "1022",
                    "question": "How do I feel when someone asks me to compromise a value I believe in? Describe  in loving detail."
                },
                {
                    "id": "1023",
                    "question": "How do I feel when someone falsely accuses me of something? Describe in loving  detail."
                },
                {
                    "id": "1024",
                    "question": "What aspect of myself do I still try to hide from others? How do I feel about  my answer?"
                },
                {
                    "id": "1025",
                    "question": "What general attitudes in others do I find most annoying? HDIFAMA?"
                },
                {
                    "id": "1026",
                    "question": "How would I feel about trading places for a day? Describe in loving detail."
                },
                {
                    "id": "1027",
                    "question": "What song most makes me think of you? HDIF sharing this with you?"
                },
                {
                    "id": "1028",
                    "question": "Do I prefer grand ideas, plans, and dreams, or more achievable ideas, plans,  and dreams? HDIF sharing this with you?"
                },
                {
                    "id": "1029",
                    "question": "What piece of music is especially meaningful to me and why? HDIF sharing this  with you?"
                },
                {
                    "id": "1030",
                    "question": "Does our home reflect our values? HDMAMMF?"
                },
                {
                    "id": "1031",
                    "question": "How do I feel about your/my/our involvement with work? Describe in loving  detail."
                },
                {
                    "id": "1032",
                    "question": "The song that I think represents our love the best is... Why? HDIF sharing this  with you?"
                },
                {
                    "id": "1033",
                    "question": "Few things are as confusing as one who gives good advice but sets a bad  example. Do I live the values I profess, or do I say one thing but do another?  HDIFAMA?"
                },
                {
                    "id": "1034",
                    "question": "Do I run more on a schedule, or just take things as they come? HDMAMMF?"
                },
                {
                    "id": "1035",
                    "question": "Is (Was) our family (parents, children, etc.) being short changed by our  Retrouvaille involvement, or are we setting a loving example for them? HDIFAMA?"
                },
                {
                    "id": "1036",
                    "question": "Am I a different person with you than I am with others? If so, how? HDIF  sharing this with you?"
                },
                {
                    "id": "1037",
                    "question": "How does my mask disappoint, frustrate, or annoy others? HDIFAMA?"
                },
                {
                    "id": "1038",
                    "question": "HDIF when you are driving and I am a passenger?"
                },
                {
                    "id": "1039",
                    "question": "Conviction is worthless unless it is converted into conduct.'   Thomas Carlyle  Do I live out my convictions? Where do I need to improve? HDIFAMA?"
                },
                {
                    "id": "1040",
                    "question": "Do I look for self worth in possessions or activities? HDIFAMA?"
                },
                {
                    "id": "1041",
                    "question": "Do I use alcohol, caffeine, or nicotine? If so, for what? HDIFAMA?"
                },
                {
                    "id": "1042",
                    "question": "Everything and everyone has its beauty, but not everyone sees it. Do I look for  the beauty in others, or do I look at the surface? HDIFAMA?"
                },
                {
                    "id": "1043",
                    "question": "How have I changed since our Retrouvaille weekend? HDIFAT?"
                },
                {
                    "id": "1044",
                    "question": "Do I think I have lost some of my independence since our Retrouvaille weekend?  HDIFAT?"
                },
                {
                    "id": "1045",
                    "question": "HDIF when I think about making a will?"
                },
                {
                    "id": "1046",
                    "question": "HDIF about hugging other people?"
                },
                {
                    "id": "1047",
                    "question": "What do I value most in my life? HDIF sharing this with you?"
                },
                {
                    "id": "1048",
                    "question": "If I were asked to draw a picture of something representing each member of my  family, what would I draw and why? HDIFAMA?"
                },
                {
                    "id": "1049",
                    "question": "Where would I like to go on vacation if I could go anywhere in the world?  HDIFAMA?"
                },
                {
                    "id": "1050",
                    "question": "How well do I live up to the dreams I had for myself when I was young?  HDIFAMA?"
                },
                {
                    "id": "1051",
                    "question": "If I could live my life over again, I would... HDIFAT?"
                },
                {
                    "id": "1052",
                    "question": "How do I feel when someone takes up too much of my time? Describe in loving  detail."
                },
                {
                    "id": "1053",
                    "question": "How do I feel about my/our local community, or lack there of? Describe in  loving detail."
                },
                {
                    "id": "1054",
                    "question": "How do I feel about my self image? Describe in loving detail."
                },
                {
                    "id": "1055",
                    "question": "In order to solve a problem, am I more likely to use common sense or  imagination? HDIFAMA?"
                },
                {
                    "id": "1056",
                    "question": "How do I feel about the phrase, 'Each day is an opportunity for a fresh start?'  Describe in loving detail."
                },
                {
                    "id": "1057",
                    "question": "Do I try to control you sometimes? When? HDIFAMA?"
                },
                {
                    "id": "1058",
                    "question": "In what aspect of my life do I have the least peace? HDIFAT?"
                },
                {
                    "id": "1059",
                    "question": "What aspect of my life brings me the most peace? HDIFAMA?"
                },
                {
                    "id": "1060",
                    "question": "What does peace mean to me? HDIFAMA?"
                },
                {
                    "id": "1061",
                    "question": "What causes the most friction between us? (Not conflict, but the little things  that rub each other the wrong way.) HDIFAMA?"
                },
                {
                    "id": "1062",
                    "question": "Am I more likely to put a decision off to the last minute, or make a decision  immediately? HDIFAMA?"
                },
                {
                    "id": "1063",
                    "question": "How do I feel when I judge you are better than me at something that I take  pride in my ability to do? Describe in loving detail."
                },
                {
                    "id": "1064",
                    "question": "Would I rather work for somebody fair but not kind, or kind but not fair?  HDIFAMA?"
                },
                {
                    "id": "1065",
                    "question": "What TV shows do I watch most often? What does this tell me about myself?  HDIFAMA?"
                },
                {
                    "id": "1066",
                    "question": "Would people outside of our community be more likely to call me warm and  sympathetic, or cold and aloof? HDIFAMA?"
                },
                {
                    "id": "1067",
                    "question": "How do I feel about my physical appearance? Describe in loving detail."
                },
                {
                    "id": "1068",
                    "question": "How do I feel about our time (or lack there of) for relaxation and  entertainment? Describe in loving detail."
                },
                {
                    "id": "1069",
                    "question": "How do I feel about discussing politics with someone who's views differ from  mine? Describe in loving detail."
                },
                {
                    "id": "1070",
                    "question": "What is the motivating force in my life? HDIFAMA?"
                },
                {
                    "id": "1071",
                    "question": "I think I am best known for... HDIFAMA? (Since we wear different masks, and use  different behaviors depending on where we are and who we are with, you could  split this up for work, home, M.E., etc.)"
                },
                {
                    "id": "1072",
                    "question": "One of my heroes is... Why? HDIF sharing this with you?"
                },
                {
                    "id": "1073",
                    "question": "If we could go anywhere, where would I most like to take you? HDIF sharing this  with you?"
                },
                {
                    "id": "1074",
                    "question": "What is my favorite memory of us from last year? HDIF sharing this with you?"
                },
                {
                    "id": "1075",
                    "question": "What is the greatest challenge we face as a couple?"
                },
                {
                    "id": "1076",
                    "question": "If I were an animal, what would I be? HDTMMF?"
                },
                {
                    "id": "1077",
                    "question": "Where do I see us 5 (10, 15, 20...) years from now? HDIFAT?"
                },
                {
                    "id": "1078",
                    "question": "What is the wildest thing I've ever done? HDIF sharing this with you?"
                },
                {
                    "id": "1079",
                    "question": "In what ways could I refocus my priorities to better serve my family, friends,  neighbors, and God? HDIFAMA?"
                },
                {
                    "id": "1080",
                    "question": "'An admision of error is a sign of strength rather than weakness.' Is it easy  or hard for me to admit my mistakes? HDIFAMA?"
                },
                {
                    "id": "1081",
                    "question": "How well do I accept others outside of Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "1082",
                    "question": "I judge I failed as/at... HDIFAMA?"
                },
                {
                    "id": "1083",
                    "question": "This week, how have I been judgemental of you? HDIFAMA?"
                },
                {
                    "id": "1084",
                    "question": "This week, how have I been judgemental of others? HDIFAMA?"
                },
                {
                    "id": "1085",
                    "question": "Does our home reflect our values? HDMAMMF?"
                },
                {
                    "id": "1086",
                    "question": "What effect does music have on me? HDIFAMA?"
                },
                {
                    "id": "1087",
                    "question": "How important are material things to me? HDIFAMA?"
                },
                {
                    "id": "1088",
                    "question": "How do the attitudes and behaviors of others affect our relationship? HDIFAMA?"
                },
                {
                    "id": "1089",
                    "question": "What is my favorite time of year, and why? HDTMMF?"
                },
                {
                    "id": "1090",
                    "question": "I smiled today when I thought about. . . . HDIFAMA?"
                },
                {
                    "id": "1091",
                    "question": "What side of me do I least like others to see? HDIFAMA?"
                },
                {
                    "id": "1092",
                    "question": "I am a better person because of you. HDIFAT?"
                },
                {
                    "id": "1093",
                    "question": "Am I a leader or a follower? HDIFAMA?"
                },
                {
                    "id": "1094",
                    "question": "Why do I want to dialogue in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1095",
                    "question": "What do I hope to gain in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1096",
                    "question": "What do I like best about you in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1097",
                    "question": "What do I like least about you in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1098",
                    "question": "What do I like best about myself in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1099",
                    "question": "What do I like best about us in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1100",
                    "question": "What do I like least about myself in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1101",
                    "question": "What mask do I wear in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1102",
                    "question": "When am I least open to listen to you in the area of superiority? HDIFAT?"
                },
                {
                    "id": "1103",
                    "question": "In the area of superiority what feeling do I find most difficult to share with  you? Describe feelings in loving detail."
                },
                {
                    "id": "1104",
                    "question": "Why do I want to dialogue in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1105",
                    "question": "What do I hope to gain in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1106",
                    "question": "What do I like best about you in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1107",
                    "question": "What do I like least about you in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1108",
                    "question": "What do I like best about myself in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1109",
                    "question": "What do I like least about myself in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1110",
                    "question": "What do I like best about us in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1111",
                    "question": "What mask do I wear in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1112",
                    "question": "When am I least open to listen to you in the area of use of time? HDIFAT?"
                },
                {
                    "id": "1113",
                    "question": "In the area of use of time what feeling do I find most difficult to share with  you? Describe feelings in loving detail."
                },
                {
                    "id": "1114",
                    "question": "To become more fully human and lovable and at the same time achieve a greater  growth in my married life, how can I be more myself? HDIFAMA?"
                },
                {
                    "id": "1115",
                    "question": "To become more fully human and lovable and at the same time achieve a greater  growth in my married life, how can I be more assertive?\" HDMAMMF?"
                },
                {
                    "id": "1116",
                    "question": "What do I most like to do in my free time? HDIFAMA?"
                },
                {
                    "id": "1117",
                    "question": "How have I been separate from you lately? HDIFAMA?"
                },
                {
                    "id": "1118",
                    "question": "If I was stranded on an island without you, what one thing would I take to  remind me of you and why? HDIF sharing this with you?"
                },
                {
                    "id": "1119",
                    "question": "Do I presume the best or worst about you? HDIFAMA?"
                },
                {
                    "id": "1120",
                    "question": "My top priorities in life are... HDIFAMA?"
                },
                {
                    "id": "1121",
                    "question": "How do I feel when I am not listened to, and then something goes wrong because  of it? Describe in loving detail."
                },
                {
                    "id": "1122",
                    "question": "When we first met, what made me want to see you again? HDIFA this now?"
                },
                {
                    "id": "1123",
                    "question": "Do we challenge others to live their values? HDIFAMA?"
                },
                {
                    "id": "1124",
                    "question": "In which direction are we heading? HDMAMMF?"
                },
                {
                    "id": "1125",
                    "question": "If I judge we are not heading in the right direction, what can I do to change  it? HDMAMMF?"
                },
                {
                    "id": "1126",
                    "question": "What difficulties are me most likely to experience when trying to make a hard  decision? H DIFAMA?"
                },
                {
                    "id": "1127",
                    "question": "What part of the day would I most like to share with you? HDIF telling you  this?"
                },
                {
                    "id": "1128",
                    "question": "If I could travel anywhere in the world, where would I go, and why? HDIFAT?"
                },
                {
                    "id": "1129",
                    "question": "How do I feel when I see you suffering? Describe in loving detail."
                },
                {
                    "id": "1130",
                    "question": "What helps me get up and going in the morning? HDIF about this?"
                },
                {
                    "id": "1131",
                    "question": "Am I more likely to look for the easiest way, or the right way? HDIFAMA?"
                },
                {
                    "id": "1132",
                    "question": "What am I most likely to do when I waste time? HDIFA This?"
                },
                {
                    "id": "1133",
                    "question": "\" 'Happiness is inward and not outward; and so it does not depend on what we  have, but on what we are.'    Henry van Dyke. HDIFAT?"
                },
                {
                    "id": "1134",
                    "question": "Am I more likely to admit my mistakes, or try to cover them up? HDIFAMA?"
                },
                {
                    "id": "1135",
                    "question": "Do I give or take too much from you/others? HDIFAMA?"
                },
                {
                    "id": "1136",
                    "question": "What are my feelings regarding how I spend my time? HDIF sharing these thoughts with you?"
                },
                {
                    "id": "1137",
                    "question": "How does dealing with my past make me feel?"
                },
                {
                    "id": "1138",
                    "question": "How does dealing with your past make me feel?"
                },
                {
                    "id": "1139",
                    "question": "In what situation am I most likely to use exaggeration? HDIFAMA?"
                },
                {
                    "id": "1140",
                    "question": "So the Lord answers, \"Can a woman forget her own baby and not love the child  she bore? Even if a mother should forget her child, I will never forget you.  Jerusalem, I can never forget you! I have written your name on the palm of my  hands.\" Isaiah 49:15 16 What does this mean to me? HDIFAT?"
                },
                {
                    "id": "1141",
                    "question": "Do I distort things to make myself look or feel better? HDIFAMA?"
                },
                {
                    "id": "1142",
                    "question": "How do I feel when someone drops in unexpectedly? DILD."
                },
                {
                    "id": "1143",
                    "question": "How do I feel when we work together to get a tough job done in a short time?  DILD."
                },
                {
                    "id": "1144",
                    "question": "What issue do we have facing us that I haven't shared my feelings with you  about? What are my feelings about this issue? HDTMMF?"
                },
                {
                    "id": "1145",
                    "question": "What do I see as your strengths? HDIF sharing this with you?"
                },
                {
                    "id": "1146",
                    "question": "What is my fondest memory of our early days together? What do I remember most?  HDIF sharing this with you?"
                },
                {
                    "id": "1147",
                    "question": "What can I do this week to make memories? HDMAMMF?"
                },
                {
                    "id": "1148",
                    "question": "How do/would I feel if someone unexpectedly gave me a hug after a hard day?  Describe in loving detail."
                },
                {
                    "id": "1149",
                    "question": "Your most endearing quality today is  _______. HDIF sharing this with you?"
                },
                {
                    "id": "1150",
                    "question": "How do I feel about my current state of health? Describe in loving detail."
                },
                {
                    "id": "1151",
                    "question": "In what area(s) do I compete against you? HDIF telling you this?"
                },
                {
                    "id": "1152",
                    "question": "What kind of compliment is hardest for me to accept? HDIFAMA?"
                },
                {
                    "id": "1153",
                    "question": "How do I feel looking through a photo album or scrapbook? Describe in loving  detail."
                },
                {
                    "id": "1154",
                    "question": "Do I ever delay too long in making a decision and miss out on an opportunity?  HDIFAMA?"
                },
                {
                    "id": "1155",
                    "question": "When I think about all the couples and priest who made our Retrouvaille program  possible, I feel ________ "
                },
                {
                    "id": "1156",
                    "question": "How do I feel about telling others about Retrouvaille? HDIFAMA?"
                },
                {
                    "id": "1157",
                    "question": "What about our lives would I like to change? HDIF telling you this?"
                },
                {
                    "id": "1158",
                    "question": "Where am I most selfish? HDIF sharing this with you?"
                },
                {
                    "id": "1159",
                    "question": "How do I feel when I allow circumstances to make a decision for me? Describe in  loving detail."
                },
                {
                    "id": "1160",
                    "question": "How have you helped me to become a better person? HDIFAMA?"
                },
                {
                    "id": "1161",
                    "question": "In what area(s) do I consider myself superior to you? HDIFAMA?"
                },
                {
                    "id": "1162",
                    "question": "How do I feel about the current political atmosphere in my/our country? DILD."
                },
                {
                    "id": "1163",
                    "question": "How do I feel when I see others suffering? DILD."
                },
                {
                    "id": "1164",
                    "question": "What new awareness have I discovered in you this past week? HDIFTYT?"
                },
                {
                    "id": "1165",
                    "question": "HDIF about winter weather?"
                },
                {
                    "id": "1166",
                    "question": "Do you feel better enjoying the present or anticipating the future?"
                },
                {
                    "id": "1167",
                    "question": "I look(ed) forward to celebrating this day with you because _______."
                },
                {
                    "id": "1168",
                    "question": "HDIF when you hurt or when you're sick?"
                },
                {
                    "id": "1169",
                    "question": "If I knew we had no tomorrow, how would I live today with you?"
                },
                {
                    "id": "1170",
                    "question": "Does my attitude change with the coming of spring?"
                },
                {
                    "id": "1171",
                    "question": "What song reminds me of our relationship right now? HDIFTYT?"
                },
                {
                    "id": "1172",
                    "question": "What makes our house a home?"
                },
                {
                    "id": "1173",
                    "question": "What would be my idea of a good family outing?"
                },
                {
                    "id": "1174",
                    "question": "WAMF about our family vacation time?"
                },
                {
                    "id": "1175",
                    "question": "HDIF about the way we spent last weekend?"
                },
                {
                    "id": "1176",
                    "question": "HDIF about getting other people's advice for solving our problems?"
                },
                {
                    "id": "1177",
                    "question": "What family memories of Spring do I have? HDMAMMF?"
                },
                {
                    "id": "1178",
                    "question": "Who should we pass the gift of Retrouvaille on to?"
                },
                {
                    "id": "1179",
                    "question": "How do I feel about sharing the chores? HDMAMMF?"
                },
                {
                    "id": "1180",
                    "question": "What was our closest moment as a family this month? HDIFAT?"
                },
                {
                    "id": "1181",
                    "question": "How close are we as a family? HDIFAT?"
                },
                {
                    "id": "1182",
                    "question": "HDIF when I call you up just to say Hi?"
                },
                {
                    "id": "1183",
                    "question": "HDIF when I stop with you for ice cream?"
                },
                {
                    "id": "1184",
                    "question": "When was the last time I felt complete inner peace? HDMAMMF?"
                },
                {
                    "id": "1185",
                    "question": "How does the season summer, affect me?"
                },
                {
                    "id": "1186",
                    "question": "How can I tell that you've had a bad day?"
                },
                {
                    "id": "1187",
                    "question": "You cannot compromise another person's right to be an individual. HDIFAT?"
                },
                {
                    "id": "1188",
                    "question": "What hinders us from making better decisions? HDIFAT?"
                }
            ]
        },
        {
            "id": "24",
            "category": "Prayer",
            "plan": "1",
            "priority": "24",
            "questions": [
                {
                    "id": "1189",
                    "question": "Be strong and courageous. Do not be terrified; do not be discouraged, for the  Lord your God will be with you wherever you go.'    Joshua 1:9. Have I given up  when I should have prayed for strength? HDIFAMA?"
                },
                {
                    "id": "1190",
                    "question": "Am I afraid of something that God would give me strength to overcome, if I  prayed to Him about it? HDIFAT?"
                },
                {
                    "id": "1191",
                    "question": "How do I feel when I see children praying? Describe in loving detail."
                },
                {
                    "id": "1192",
                    "question": "My prayers are answered in God's time or my time? HDMAMMF?"
                },
                {
                    "id": "1193",
                    "question": "Do we make the time to pray with our friends? HDIFAMA?"
                },
                {
                    "id": "1194",
                    "question": "Outside of services, do I take the time to really pray with my people?  HDIFAMA?"
                },
                {
                    "id": "1195",
                    "question": "My whole life should be a prayer to God. How well do I live this? HDIFAMA?"
                },
                {
                    "id": "1196",
                    "question": "What do I judge as the most important things I pray about? HDIF sharing this  with you?"
                },
                {
                    "id": "1197",
                    "question": "What can I do to make prayer a bigger part of our life? HDIFAMA?"
                },
                {
                    "id": "1198",
                    "question": "Why do I want to dialogue in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1199",
                    "question": "What do I hope to gain in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1200",
                    "question": "What do I like best about you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1201",
                    "question": "What do I like least about you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1202",
                    "question": "What do I like best about myself in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1203",
                    "question": "What do I like least about myself in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1204",
                    "question": "What do I like best about us in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1205",
                    "question": "What mask do I wear in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1206",
                    "question": "When am I least open to listen to you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1207",
                    "question": "In the area of prayer what feeling do I find most difficult to share with you?  Describe feelings in loving detail."
                },
                {
                    "id": "1208",
                    "question": "How do I feel hearing about the power of our prayer? Describe in loving  detail."
                },
                {
                    "id": "1209",
                    "question": "Why do I want to dialogue in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1210",
                    "question": "What do I hope to gain in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1211",
                    "question": "What do I like best about you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1212",
                    "question": "What do I like least about you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1213",
                    "question": "What do I like best about myself in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1214",
                    "question": "What do I like least about myself in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1215",
                    "question": "What do I like best about us in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1216",
                    "question": "What mask do I wear in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1217",
                    "question": "When am I least open to listen to you in the area of prayer? HDIFAT?"
                },
                {
                    "id": "1218",
                    "question": "In the area of prayer what feeling do I find most difficult to share with you?  Describe feelings in loving detail."
                },
                {
                    "id": "1219",
                    "question": "How do I feel hearing about the power of our prayer? Describe in loving  detail."
                }
            ]
        },
        {
            "id": "25",
            "category": "Romance",
            "plan": "1",
            "priority": "25",
            "questions": [
                {
                    "id": "1220",
                    "question": "What one thing this week did we do as a couple to foster passion in our  relationship? HDIFAMA?"
                },
                {
                    "id": "1221",
                    "question": "When was the last time I told you how special you are? HDIFAMA?"
                },
                {
                    "id": "1222",
                    "question": "What specifically can I do this week to create a little more romance? HDIFAMA?"
                },
                {
                    "id": "1223",
                    "question": "What do I think is keeping us out of romance right now? HDTMMF?"
                },
                {
                    "id": "1224",
                    "question": "If I could go back in time with you, what period would I like to revisit?  HDTMMF?"
                },
                {
                    "id": "1225",
                    "question": "HDIF planning a romantic evening with you?"
                },
                {
                    "id": "1226",
                    "question": "HDIF thinking about the first time I knew you were for me?"
                },
                {
                    "id": "1227",
                    "question": "How do I want you to romance me? HDIFAMA?"
                },
                {
                    "id": "1228",
                    "question": "How do I feel about a walk in the moonlight with you? Describe in loving  detail."
                },
                {
                    "id": "1229",
                    "question": "How do I feel when you tell me, 'I need a hug'? Describe in loving detail."
                },
                {
                    "id": "1230",
                    "question": "What romantic thing would I like you to do for me? HDIF telling you this?"
                },
                {
                    "id": "1231",
                    "question": "What does Valentine's day mean to me? HDIF sharing this with you?"
                },
                {
                    "id": "1232",
                    "question": "Do I think you would consider me to be a romantic? HDIFAMA?"
                },
                {
                    "id": "1233",
                    "question": "What do I think about my ability as your lover? HDIFAMA?"
                },
                {
                    "id": "1234",
                    "question": "What do I think about my ability to accept your loving me? HDIFAMA?"
                },
                {
                    "id": "1235",
                    "question": "How do I feel about going with you to a movie, or watching a TV show, about a  love story? Describe in loving detail."
                },
                {
                    "id": "1236",
                    "question": "What was the last romantic thing I did for you? HDIFAMA?"
                },
                {
                    "id": "1237",
                    "question": "How important do I think romance is in our relationship? How do I feel about  making romance a priority in our relationship? HDMAMMF?"
                },
                {
                    "id": "1238",
                    "question": "How do I feel towards you when I am filled with romance? HDIF sharing this with  you?"
                },
                {
                    "id": "1239",
                    "question": "What romantic things do I remember most from our dating or early marriage? HDIF  about them now?"
                },
                {
                    "id": "1240",
                    "question": "What romantic things do you do for me? HDIF when I think about them?"
                },
                {
                    "id": "1241",
                    "question": "What romantic things would I like you to do for me? HDIF sharing this with  you?"
                },
                {
                    "id": "1242",
                    "question": "What barriers keep me/us from being romantic? HDMAMMF?"
                },
                {
                    "id": "1243",
                    "question": "What is my dream for a perfect romantic evening? HDIF about this? HDIF sharing  this with you?"
                },
                {
                    "id": "1244",
                    "question": "When do I feel the most romantic? What are my feelings at those times? HDIF  sharing this with you?"
                },
                {
                    "id": "1245",
                    "question": "When do I feel the least romantic? What are my feelings at those times?  HDIFAMA?"
                },
                {
                    "id": "1246",
                    "question": "What have you done in the last week to make me feel romantic? What are my  feelings sharing this with you?"
                },
                {
                    "id": "1247",
                    "question": "What do I remember as the most romantic moment in our relationship? What are my  feelings remembering this? HDIF sharing this with you?"
                },
                {
                    "id": "1248",
                    "question": "How do I feel when you go out of your way to do something nice for me? Describe  in loving detail."
                },
                {
                    "id": "1249",
                    "question": "A time I felt closest to you was... HDIF sharing this with you?"
                },
                {
                    "id": "1250",
                    "question": "When recently did you do something that made me feel special? How does  remembering this MMF?"
                },
                {
                    "id": "1251",
                    "question": "How (in what way) would I like to be romanced by you? HDIF sharing this with  you?"
                },
                {
                    "id": "1252",
                    "question": "What was our closest moment, as a couple, this past week? HDIFTYT"
                },
                {
                    "id": "1253",
                    "question": "Are we as romantic as we need to be? HDIFTYT?"
                },
                {
                    "id": "1254",
                    "question": "HDIF planning a romantic time together?"
                },
                {
                    "id": "1255",
                    "question": "You are my sweetheart because ________."
                },
                {
                    "id": "1256",
                    "question": "Is passion an important aspect of our relationship?"
                }
            ]
        },
        {
            "id": "26",
            "category": "Sex",
            "plan": "1",
            "priority": "26",
            "questions": [
                {
                    "id": "1257",
                    "question": "How do I feel when we try something different in our lovemaking? Describe in  loving detail."
                },
                {
                    "id": "1258",
                    "question": "What actions or behaviors do I/you use to say no to sex non verbally or  indirectly? HDIFAMA?"
                },
                {
                    "id": "1259",
                    "question": "What fears do I have about our lovemaking? HDIF sharing this with you?"
                },
                {
                    "id": "1260",
                    "question": "Is there wonder or boredom in our lovemaking? HDIFAMA?"
                },
                {
                    "id": "1261",
                    "question": "What can we do to improve our sex life?"
                },
                {
                    "id": "1262",
                    "question": "Have I ever thought that you used me sexually? Describe how you felt, and feel  in loving detail."
                },
                {
                    "id": "1263",
                    "question": "For what reason am I most likely to tell you 'no' when you want to make love?  HDIF sharing this with you?"
                },
                {
                    "id": "1264",
                    "question": "What risk am I willing to take to love you sexually the way you want to be  loved? HDIFAMA?"
                },
                {
                    "id": "1265",
                    "question": "What effect does making love to you have on me? HDIFAT?"
                },
                {
                    "id": "1266",
                    "question": "What parts of your body are sexually exciting to me? HDIF sharing this with  you?"
                },
                {
                    "id": "1267",
                    "question": "What strengths do you bring to our sexuality? HDIF sharing this with you now?"
                },
                {
                    "id": "1268",
                    "question": "Do I give you my full attention when we make love, or do I get distracted by  other things? HDIFAMA?"
                },
                {
                    "id": "1269",
                    "question": "Does my attitude toward sex lock some doors in our relationship? HDTMMF?"
                },
                {
                    "id": "1270",
                    "question": "Do I see our sexual relationship as an expression of our total relationship?  HDTMMF?"
                },
                {
                    "id": "1271",
                    "question": "HDIF when I know we're going to have sex?"
                },
                {
                    "id": "1272",
                    "question": "HDIF when you are hungry for sex?"
                },
                {
                    "id": "1273",
                    "question": "What part does God play in our sexual communication! HDIFAT?"
                },
                {
                    "id": "1274",
                    "question": "What part do I play in our sexual communication! WAFAT?"
                },
                {
                    "id": "1275",
                    "question": "How do I feel about the last time we made love? Describe in loving detail."
                },
                {
                    "id": "1276",
                    "question": "Besides our bed, where would I most like to make love to you? HDIFAMA?"
                },
                {
                    "id": "1277",
                    "question": "What can I do to improve our sexual relationship? HDIFAMA?"
                },
                {
                    "id": "1278",
                    "question": "Does our lovemaking extend beyond the bedroom? HDIFAMA?"
                },
                {
                    "id": "1279",
                    "question": "Do I usually initiate our love making, or do I wait for you? HDIFAMA?"
                },
                {
                    "id": "1280",
                    "question": "How do I feel when you say no to making love? Describe in loving detail."
                },
                {
                    "id": "1281",
                    "question": "How do I feel when I/you initiate our love making? Describe in loving detail."
                },
                {
                    "id": "1282",
                    "question": "I enjoy our sexual relationship the most when... HDIF sharing this with you?"
                },
                {
                    "id": "1283",
                    "question": "What do I think about my ability as your lover? HDIFAMA?"
                },
                {
                    "id": "1284",
                    "question": "Do I think we talk about our lovemaking enough? HDIFAMA?"
                },
                {
                    "id": "1285",
                    "question": "How do I feel when one of my people shares details of their intimate family  life with me?"
                },
                {
                    "id": "1286",
                    "question": "On a scale of 1 10, how would I rate our sexual relationship? HDIFAMA?"
                },
                {
                    "id": "1287",
                    "question": "My ideal lovemaking would be... HDIF sharing this with you?"
                },
                {
                    "id": "1288",
                    "question": "What are my attitudes in the area of our sexual relationship that could cause  us not to be as close as we could be? HDIFAT?"
                },
                {
                    "id": "1289",
                    "question": "How does my mask interfere with our lovemaking? HDIFAT?"
                },
                {
                    "id": "1290",
                    "question": "Do I ever feel used in our lovemaking? HDIF Sharing this with you?"
                },
                {
                    "id": "1291",
                    "question": "What aspect of our lovemaking do I enjoy the most? HDIF sharing this with you?"
                },
                {
                    "id": "1292",
                    "question": "Why do I want to dialogue in the area of sex? HDIFAT?"
                },
                {
                    "id": "1293",
                    "question": "What do I hope to gain in the area of sex? HDIFAT?"
                },
                {
                    "id": "1294",
                    "question": "What do I like best about you in the area of sex? HDIFAT?"
                },
                {
                    "id": "1295",
                    "question": "What do I like least about you in the area of sex? HDIFAT?"
                },
                {
                    "id": "1296",
                    "question": "What do I like best about myself in the area of sex? HDIFAT?"
                },
                {
                    "id": "1297",
                    "question": "What do I like least about myself in the area of sex? HDIFAT?"
                },
                {
                    "id": "1298",
                    "question": "What do I like best about us in the area of sex? HDIFAT?"
                },
                {
                    "id": "1299",
                    "question": "What mask do I wear in the area of sex? HDIFAT?"
                },
                {
                    "id": "1300",
                    "question": "When am I least open to listen to you in the area of sex? HDIFAT?"
                },
                {
                    "id": "1301",
                    "question": "In the area of sex what feeling do I find most difficult to share with you?  Describe feelings in loving detail."
                },
                {
                    "id": "1302",
                    "question": "How do I feel about the amount of time we spend on foreplay? Describe in loving  detail."
                },
                {
                    "id": "1303",
                    "question": "How is our sex life? If I think it is unsatisfactory, how can I make it better?  HDMAMMF?"
                },
                {
                    "id": "1304",
                    "question": "If our lovemaking is a form of communication, how well are we communicating?  HDMAMMF?"
                },
                {
                    "id": "1305",
                    "question": "What is it about you that I find most attractive? HDIF sharing this with you?"
                },
                {
                    "id": "1306",
                    "question": "What is an attitude I had about sex entering marriage? HDIF sharing this with  you?"
                },
                {
                    "id": "1307",
                    "question": "On a scale of 1 10, I would rate our sex life a... How could it improve? HDIFA  sharing this with you?"
                },
                {
                    "id": "1308",
                    "question": "Where do I place our time for making love on my lists of priorities? Is this a  value or an ideal? HDIF telling you this?"
                },
                {
                    "id": "1309",
                    "question": "Lately, how have I responded to you sexually? HDIFAMA?"
                },
                {
                    "id": "1310",
                    "question": "What are my expectations for our love making? HDIFSTWY?"
                },
                {
                    "id": "1311",
                    "question": "What can I do to make myself more sexy to you? HDIFAMA?"
                },
                {
                    "id": "1312",
                    "question": "What are my attitudes about our sex life?"
                },
                {
                    "id": "1313",
                    "question": "HDIF discussing our sex life?"
                },
                {
                    "id": "1314",
                    "question": "When I think of sexual desire, I think of _________."
                },
                {
                    "id": "1315",
                    "question": "HDIF when our lovemaking is interrupted?"
                }
            ]
        },
        {
            "id": "27",
            "category": "Stress",
            "plan": "1",
            "priority": "27",
            "questions": [
                {
                    "id": "1316",
                    "question": "If our house were burning down, and I could only save 3 things, what would they  be and why? HDIFAMA?"
                },
                {
                    "id": "1317",
                    "question": "What particular event today caused me the most grief, stress, enjoyment, etc.  (pick one)? HDIF sharing this with you now?\" \"How do I feel about all the  Holiday bustle? Describe in loving detail."
                },
                {
                    "id": "1318",
                    "question": "In the presence of trouble, some grow wings, others will grow crutches.' Do I  grow wings or crutches? HDIFAMA?"
                },
                {
                    "id": "1319",
                    "question": "When time is short, do I handle the situation well, or do I tend to go into  panic mode? HDIFAMA?"
                },
                {
                    "id": "1320",
                    "question": "Am I honest with you about my feelings when I am stressed? HDIFAMA?"
                },
                {
                    "id": "1321",
                    "question": "Am I more likely to take things too lighty, or worry too much? HDIFAMA?"
                },
                {
                    "id": "1322",
                    "question": "\" 'God will give us nothing we can't handle.' What this doesn't say is that we  must ask for His loving assistance sometimes (most of the time?). But with His  assistance, we can truly perform wonders! HDTMMF?"
                },
                {
                    "id": "1323",
                    "question": "How do I feel when I've had a very stressful day? What are my feelings sharing  this with you?"
                },
                {
                    "id": "1324",
                    "question": "How do I feel when I make a promise to do something, but need to break it  because of something even more important? Describe in loving detail."
                },
                {
                    "id": "1325",
                    "question": "Do I/we seek support when I/we are struggling? HDIFFAMA?"
                },
                {
                    "id": "1326",
                    "question": "What, if anything, causes unnecessary stress and complication in my/our life?  HDIFAMA?"
                },
                {
                    "id": "1327",
                    "question": "How do I feel when I have to take a risk with someone other than you? DILD."
                },
                {
                    "id": "1328",
                    "question": "HDIF when you expect more of me than I am capable of giving right now?"
                },
                {
                    "id": "1329",
                    "question": "HDIF when you try to influence my decisions?"
                },
                {
                    "id": "1330",
                    "question": "Do I experience stress as a positive or a negative? DYFID."
                },
                {
                    "id": "1331",
                    "question": "Can I recognize when I'm under stress? HDIFAMA?"
                },
                {
                    "id": "1332",
                    "question": "Would I feel better keeping weekends relatively unplanned?"
                },
                {
                    "id": "1333",
                    "question": "HDIF when I see the stress building up in you? HDIFTYT?"
                }
            ]
        },
        {
            "id": "28",
            "category": "Trust",
            "plan": "1",
            "priority": "28",
            "questions": [
                {
                    "id": "1334",
                    "question": "What quality do I look for in others that helps me believe I can trust them?  HDIFAMA?"
                },
                {
                    "id": "1335",
                    "question": "What can I do to make it easier for you to confide in me? HDIFAMA?"
                },
                {
                    "id": "1336",
                    "question": "How has my confidence in you changed since our weekend? HDMAMMF?"
                },
                {
                    "id": "1337",
                    "question": "What keeps me from trusting you completely? HDIFAMA?"
                },
                {
                    "id": "1338",
                    "question": "Would I rate the level of trust in our relationship closer to a 1 or a 10?  HDIFAMA?"
                },
                {
                    "id": "1339",
                    "question": "How well do I do trusting God to answer my needs? Describe in loving detail."
                },
                {
                    "id": "1340",
                    "question": "What can I do to make it easier for you to trust me with yourself? HDIFAMA?"
                },
                {
                    "id": "1341",
                    "question": "What would I like you to do to make it easier for me to trust you with myself?  HDIF sharing this with you?"
                },
                {
                    "id": "1342",
                    "question": "Risking builds confidence. Confidence builds trust. HDIFAT?"
                },
                {
                    "id": "1343",
                    "question": "Do I put my independence above my trust in you? HDIFAMA?"
                },
                {
                    "id": "1344",
                    "question": "In what area do I trust you the most? HDIFAMA?"
                },
                {
                    "id": "1345",
                    "question": "In what area do I trust you the least? HDIFAMA?"
                },
                {
                    "id": "1346",
                    "question": "Do I trust God enough to get into the wheelbarrow? HDIFAMA?"
                },
                {
                    "id": "1347",
                    "question": "How many times does God have to ask me before I get into the wheelbarrow?  HDIFAMA?"
                }
            ]
        },
        {
            "id": "29",
            "category": "Values",
            "plan": "1",
            "priority": "29",
            "questions": [
                {
                    "id": "1348",
                    "question": "What values of mine differ from yours? How does this effect our relationship?  HDIFAMA?"
                },
                {
                    "id": "1349",
                    "question": "What are three values I have? What are three values I think you have? What are  three values we share together ?"
                },
                {
                    "id": "1350",
                    "question": "What does the way I spend my time tell me about my values? Am I spending my time  on what I value the most? HDIFAT?"
                },
                {
                    "id": "1351",
                    "question": "What is the most important value I have? HDIF sharing this with you?"
                },
                {
                    "id": "1352",
                    "question": "Are the activities our child(ren) involved in an ideal for me or a value?  HDIFAT?"
                },
                {
                    "id": "1353",
                    "question": "What values, goals, or ideals will I absolutlely not compromise? HDIFAMA?"
                },
                {
                    "id": "1354",
                    "question": "Do I make other things more important than you? What? HDIFAMA?"
                },
                {
                    "id": "1355",
                    "question": "Here is my description of the ideal father _____ . HDIFTYT?"
                },
                {
                    "id": "1356",
                    "question": "HDIF when I accomplish something I'm proud of?"
                }
            ]
        },
        {
            "id": "30",
            "category": "Weekend Follow Up Qs",
            "plan": "1",
            "priority": "30",
            "questions": [
                {
                    "id": "1358",
                    "question": "What was the most significant part of the weekend for me?  HDIFAT?"
                },
                {
                    "id": "1359",
                    "question": "In what area of our relationship do I think we made the most progress on our weekend? HDIFAMA?"
                },
                {
                    "id": "1360",
                    "question": "What is a good quality I discovered about you?  HDIFAT?"
                },
                {
                    "id": "1361",
                    "question": "If I could go back in time with you, what time would I like to re-visit?  How do I feel when I think about that time?"
                },
                {
                    "id": "1362",
                    "question": "How do I feel about going to the first follow-up session?  Describe those feelings fully."
                },
                {
                    "id": "1363",
                    "question": "What was my strongest feeling today?  HDIFAMA?"
                }
            ]
        },
        {
            "id": "31",
            "category": "Post #1 Qs",
            "plan": "1",
            "priority": "31",
            "questions": [
                {
                    "id": "1364",
                    "question": "HDIF about sharing in a group?"
                },
                {
                    "id": "1365",
                    "question": "What is the best memory I have about us this past week?  HDIFAMA?"
                },
                {
                    "id": "1366",
                    "question": "We're building up and tearing down, in everything we do. \tAm I on the construction gang, or on the wrecking crew?   HDIFAMA?"
                },
                {
                    "id": "1367",
                    "question": "In what specific ways am I hopeful for our relationship?  HDIFAT?"
                },
                {
                    "id": "1368",
                    "question": "In comparing our relationship to a devastated home, what are my strongest \tfeelings when I think of re-building?"
                },
                {
                    "id": "1369",
                    "question": "What feelings do I have that are an obstacle to my commitment to the Post \tProgram?  Describe the feelings fully.  What positive option do I have?  State it."
                },
                {
                    "id": "1370",
                    "question": "Am I comfortable with change in my life?  HDIFAT?"
                },
                {
                    "id": "1371",
                    "question": "Which one of the Building Blocks of a Healthy Marriage do I want to work on now?  HDIFAMA?"
                }
            ]
        },
        {
            "id": "32",
            "category": "Post #2 Qs",
            "plan": "1",
            "priority": "32",
            "questions": [
                {
                    "id": "1372",
                    "question": "What are my hopes for our future together?  HDIFAT?"
                },
                {
                    "id": "1373",
                    "question": "What goals would I like to see us achieve in the next few months?  HDIFAMA?"
                },
                {
                    "id": "1374",
                    "question": "HDIF when you listen to me with your heart?"
                },
                {
                    "id": "1375",
                    "question": "HDIF when I judge that you have not listened to me?"
                },
                {
                    "id": "1376",
                    "question": "Building Blocks for Healthy Marriages says couples communicate and listen well.  HDIFAT?"
                },
                {
                    "id": "1377",
                    "question": "What area of dialogue do I struggle with?  What are my strongest feelings in that struggle?  What do I need to do to conquer this area?  HDIFAMA?"
                },
                {
                    "id": "1378",
                    "question": "What area in our relationship do I have most difficulty in listening to you? HDIF when I try to listen effectively?"
                },
                {
                    "id": "1379",
                    "question": "What effect does my not listening have on our relationship?  HDIFAMA?"
                }
            ]
        },
        {
            "id": "33",
            "category": "Post #3 Qs",
            "plan": "1",
            "priority": "33",
            "questions": [
                {
                    "id": "1380",
                    "question": "What event in my Family of Origin had an impact on the rest of my life? HDIFAT?"
                },
                {
                    "id": "1381",
                    "question": "How do I see our Personality Styles complimenting each other?  HDIFAMA?"
                },
                {
                    "id": "1382",
                    "question": "Did my parents do things that I told myself I would never do? How does my reaction to that parental pattern influence my relationship with you?  HDIFTYT?"
                },
                {
                    "id": "1383",
                    "question": "What is the best (or worst) parental advice I ever received and HDIFAT?"
                },
                {
                    "id": "1384",
                    "question": "What do I need to take care of most from my past so that it will not project on our relationship?  HDIFTYT?"
                },
                {
                    "id": "1385",
                    "question": "What behavior related to my personality style do I most need to change? HDIFAMA?"
                },
                {
                    "id": "1386",
                    "question": "How do I see our personality styles causing conflict between us?  HDIFAMA?"
                },
                {
                    "id": "1387",
                    "question": "What routine from my family of origin do I continue with my own family today?  HDIFAT?"
                }
            ]
        },
        {
            "id": "34",
            "category": "Post #4 Qs",
            "plan": "1",
            "priority": "34",
            "questions": [
                {
                    "id": "1388",
                    "question": "What ideal do I have that I wish was a value?  HDIFAMA?"
                },
                {
                    "id": "1389",
                    "question": "HDIF when our different interests separate us?  (or needs, expectations, values?)"
                },
                {
                    "id": "1390",
                    "question": "HDIF when I don't meet your expectations?"
                },
                {
                    "id": "1391",
                    "question": "HDIF about being responsible for my own needs?"
                },
                {
                    "id": "1392",
                    "question": "Thank you for helping fulfill my need of __________.  HDIFAT?"
                },
                {
                    "id": "1393",
                    "question": "Do I feel comfortable sharing my relationship with God with you?  HDIFAMA?"
                },
                {
                    "id": "1394",
                    "question": "What would I like to see us doing together to enhance our couple spirituality?  HDIFTYT?"
                },
                {
                    "id": "1395",
                    "question": "HDIF about my personal relationship with God?"
                }
            ]
        },
        {
            "id": "35",
            "category": "Post #5 Qs",
            "plan": "1",
            "priority": "35",
            "questions": [
                {
                    "id": "1396",
                    "question": "What have I done recently to show my commitment to you? HDIFAT?"
                },
                {
                    "id": "1397",
                    "question": "What is the biggest obstacle to my commitment to our marriage?  HDIFAMA?"
                },
                {
                    "id": "1398",
                    "question": "Name an instance where I recognized your Decision to Love me.  HDIFAMA?"
                },
                {
                    "id": "1399",
                    "question": "Name an instance where I made a Decision to Love you.  HDIFTYT?"
                },
                {
                    "id": "1400",
                    "question": "How successful have I been in balancing my career responsibilities with my marital commitments?  HDIFAT?"
                },
                {
                    "id": "1401",
                    "question": "HDIF when I decide to love?"
                },
                {
                    "id": "1402",
                    "question": "In what ways do I show my love for you daily?  HDIFAT?"
                },
                {
                    "id": "1403",
                    "question": "What steps have I taken to make the decisions that positively impact our relationship? HDIFAMA?"
                }
            ]
        },
        {
            "id": "36",
            "category": "Post #6 Qs",
            "plan": "1",
            "priority": "36",
            "questions": [
                {
                    "id": "1404",
                    "question": "What is a quality of yours that helps me to trust you?  HDIF when I experience \tthis quality of yours?"
                },
                {
                    "id": "1405",
                    "question": "HDIF when I experience your forgiveness?"
                },
                {
                    "id": "1406",
                    "question": "Forgive us our sins as we forgive others.  HDIFAT?"
                },
                {
                    "id": "1407",
                    "question": "HDIF when you say, It's okay. or Forget it. instead of I forgive you!?"
                },
                {
                    "id": "1408",
                    "question": "What makes it hard for me to seek forgiveness and HDIFAT?"
                },
                {
                    "id": "1409",
                    "question": "HDIF when I trust you with my feelings?"
                },
                {
                    "id": "1410",
                    "question": "HDIF when I am given another chance?"
                },
                {
                    "id": "1411",
                    "question": "What do I see as the greatest obstacle to trust in our relationship?  HDIFAMA?"
                }
            ]
        },
        {
            "id": "37",
            "category": "Post #7 Qs",
            "plan": "1",
            "priority": "37",
            "questions": [
                {
                    "id": "1412",
                    "question": "HDIF when I judge we are avoiding conflict between us?"
                },
                {
                    "id": "1413",
                    "question": "Do I think one of us has to be wrong for the other to be right?  HDIFAT?"
                },
                {
                    "id": "1414",
                    "question": "HDIF when I am experiencing pain or disillusionment in our relationship?"
                },
                {
                    "id": "1415",
                    "question": "How do I react when you do something that bothers me?  What can I do differently?  HDIFAT?"
                },
                {
                    "id": "1416",
                    "question": "HDIF when you confront me with a conflict between us?"
                },
                {
                    "id": "1417",
                    "question": "HDIF when I realize that my behavior has hurt you?"
                },
                {
                    "id": "1418",
                    "question": "HDIF when you seem indifferent to me?"
                },
                {
                    "id": "1419",
                    "question": "HDIF when things don't happen around the house the way I expect them to?"
                }
            ]
        },
        {
            "id": "38",
            "category": "Post #8 Qs",
            "plan": "1",
            "priority": "38",
            "questions": [
                {
                    "id": "1420",
                    "question": "How do I make up after a fight?  HDIFAT?"
                },
                {
                    "id": "1421",
                    "question": "HDIF when you reach out to me after an argument?"
                },
                {
                    "id": "1422",
                    "question": "HDIF about the importance of making decisions as a couple?"
                },
                {
                    "id": "1423",
                    "question": "How have I given up control in our relationship lately?  HDIFAT?"
                },
                {
                    "id": "1424",
                    "question": "How would I rate myself as a decision-maker and HDIFAT?"
                },
                {
                    "id": "1425",
                    "question": "Which of us do I judge comes to decisions more quickly?  HDIFAT?"
                },
                {
                    "id": "1426",
                    "question": "HDIF when we do not talk after an argument?"
                },
                {
                    "id": "1427",
                    "question": "HDIF when I put the issue ahead of our relationship?"
                }
            ]
        },
        {
            "id": "39",
            "category": "Post #9 Qs",
            "plan": "1",
            "priority": "39",
            "questions": [
                {
                    "id": "1428",
                    "question": "In what ways do I avoid being intimate with you?  HDIFTYT?"
                },
                {
                    "id": "1429",
                    "question": "When do I most enjoy being with you?  HDIF at those times?"
                },
                {
                    "id": "1430",
                    "question": "Do we have enough together time to build our relationship?  HDIFAT?"
                },
                {
                    "id": "1431",
                    "question": "In what ways do I see you as my best friend?  HDIFAT?"
                },
                {
                    "id": "1432",
                    "question": "What fun activities can we choose to do with each other?  HDIFAT?"
                },
                {
                    "id": "1433",
                    "question": "When have I felt most intimate with you?  Describe that feeling fully."
                },
                {
                    "id": "1434",
                    "question": "What are my feelings when I think about us ten years from now?"
                },
                {
                    "id": "1435",
                    "question": "HDIF about showing you affection other than when it involves sex?"
                }
            ]
        },
        {
            "id": "40",
            "category": "Post #10 Qs",
            "plan": "1",
            "priority": "40",
            "questions": [
                {
                    "id": "1436",
                    "question": "What can I do to bring more excitement & spontaneity into our relationship?  HDIFTYT?"
                },
                {
                    "id": "1437",
                    "question": "How do I tell you that I would like to make love?  HDIFTYT?"
                },
                {
                    "id": "1438",
                    "question": "How do I see the busyness of our lives affecting our sexual relationship?  HDIFAT?"
                },
                {
                    "id": "1439",
                    "question": "How do I see us living God's plan in our sexual relationship?  HDIFAT?"
                },
                {
                    "id": "1440",
                    "question": "My greatest satisfaction in our sexual relationship is _______.  HDIFAT?"
                },
                {
                    "id": "1441",
                    "question": "HDIF about my ability to satisfy your needs in our sexual relationship?"
                },
                {
                    "id": "1442",
                    "question": "What are my hopes for us in the area of sex? HDIFAT?"
                },
                {
                    "id": "1443",
                    "question": "What could physically help our lovemaking for me?  HDIF sharing this with you?"
                }
            ]
        },
        {
            "id": "41",
            "category": "Post #11 Qs",
            "plan": "1",
            "priority": "41",
            "questions": [
                {
                    "id": "1444",
                    "question": "How do we make our sacrament a visible sign of God's grace?  HDIFAT?"
                },
                {
                    "id": "1445",
                    "question": "HDIF about our church involvement?"
                },
                {
                    "id": "1446",
                    "question": "What activities strengthen our relationship with God and the Church?  HDIFAT?"
                },
                {
                    "id": "1447",
                    "question": "Do I believe we are called to be a sacramental couple?  HDIFAMA?"
                },
                {
                    "id": "1448",
                    "question": "Do I believe that God is part of our marriage?  HDIFAT?"
                },
                {
                    "id": "1449",
                    "question": "HDIF about the statement that marriage is a vocation, a call by God?"
                },
                {
                    "id": "1450",
                    "question": "We can be a sign of Christ's love to our children.  HDIFAT?"
                },
                {
                    "id": "1451",
                    "question": "HDIF about joining a support group? (e.g.  CORE, AA, Al-Anon, Gamblers Anonymous, etc.)"
                }
            ]
        },
        {
            "id": "42",
            "category": "Post #12 Qs",
            "plan": "1",
            "priority": "42",
            "questions": [
                {
                    "id": "1452",
                    "question": "HDIF when I know you are praying for me?"
                },
                {
                    "id": "1453",
                    "question": "Do we take time to thank God for our blessings?  HDIFAT?"
                },
                {
                    "id": "1454",
                    "question": "HDIF knowing that we are part of a community that supports marriage?"
                },
                {
                    "id": "1455",
                    "question": "HDIF when I think of sharing our brokenness with others?"
                },
                {
                    "id": "1456",
                    "question": "In what way do I think we have grown as a couple? HDIFAMA?"
                },
                {
                    "id": "1457",
                    "question": "I feel encouraged about us as a couple when __________.  HDIFAMA?"
                },
                {
                    "id": "1458",
                    "question": "Do I believe we have a stake in others' marriages?  HDIFAT?"
                },
                {
                    "id": "1459",
                    "question": "How can we best share our love with others?  HDIFAT?"
                }
            ]
        },
        {
            "id": "48",
            "category": "Post Dialogue Questions",
            "plan": "1",
            "priority": "43",
            "questions": [
                {
                    "id": "",
                    "question": ""
                }
            ]
        }
    ]
}